Repository: rpminspect/rpminspect-l10n
Catalog: *.po
Languages: es, it

source: Patch number %ld (%s) is missing a corresponding %%patch%ld macro, usually in %%prep.
es: Número del parche %ld (%s) le falta una macro correspondiente %%patch%ld, usualmente en %%prep.
it: Numero di patch %ld (%s) manca della macro %%patch%ld corrispondente, solitamente in %%prep.

source: missing %%patch macro for ${FILE}
es: faltando macro de %%patch para ${FILE}
it: macro %%patch mancante per ${FILE}

source: Patch number %ld (%s) is mismatched with %%patch%ld macro.
es: Número de parche %ld (%s) no coincidido con macro %%patch%ld.
it: Numero di patch %ld (%s) non corrisponde alla macro %%patch%ld.

source: mismatched %%patch macro for ${FILE}
es: no coincidió macro de %%patch para ${FILE}
it: macro %%patch non corrispondente per ${FILE}

source: undefined Patch ${FILE}
es: parche ${FILE} indefinido
it: Patch non definita ${FILE}

source: Undefined Patch file %s.
es: Parche Indefinido del archivo %s.
it: File patch non definito %s.

source: *** unable to uncompress patch: %s
es: *** no es capaz de descomprimir parche: %s
it: *** impossibile decomprimere la patch: %s

source: corrupt patch ${FILE}
es: parche ${FILE} corrupto
it: patch corrotta ${FILE}

source: Patch %s is under 4 bytes in size - is it corrupt?
es: Parche %s está bajo 4 bytes en tamaño - ¿está corrupto?
it: La patch %s ha una dimensione inferiore a 4 byte - è corrotta?

source: %s changed (%ld bytes -> %ld bytes)
es: %s cambiado (%ld bytes → %ld bytes)
it: %s cambiato (da %ld byte a %ld byte)

source: patch file ${FILE}
es: archivo de parche ${FILE}
it: file patch ${FILE}

source: New patch file `%s` appeared
es: Archivo de parche nuevo `%s` aparecido
it: È apparso un nuovo file patch `%s`

source: patch changes ${FILE}
es: parche cambia ${FILE}
it: modifiche alla patch ${FILE}

source: %s touches as many as %ld line%s
es: %s accedido tanto como %ld línea %s
it: %s tocca fino a %ld righe%s

source: %s touches %ld file%s
es: %s toca %ld archivo%s
it: %s tocca %ld file%s

source: %s touches %ld file%s and %s%ld line%s
es: %s accedido %ld archivo%s y %s%ld línea%s
it: %s tocca il file %ld%s e la riga %s%ld%s

source: as many as
es: tantos como
it: fino a

source: No source packages available, skipping inspection.
es: Ningún paquete origen disponible, inspección se hace caso omiso.
it: Nessun pacchetto sorgente disponibile, ispezione saltata.

source: Unhandled patch file `%s` defined in spec file
es: Archivo de parche `%s` no manipulado definido en archivo spec
it: File patch non gestito `%s` definito nel file spec

source: *** unrecognized %%patch line: %s
es: *** línea %%patch no reconocida: %s
it: *** riga %%patch non riconosciuta: %s

source: *** unable to read spec file line: %s
es: *** no es capaz de leer línea de archivo spec: %s
it: *** impossibile leggere la riga del file spec: %s

source: Patch file `%s` removed
es: Archivo de parche `%s` retirado
it: File patch `%s` rimosso

source: File %s found should be in %s on %s
es: Archivo %s encontrado estaría dentro de %s en %s
it: File %s trovato, dovrebbe essere in %s su %s

source: ${FILE} should be in %s on ${ARCH}
es: ${FILE} estaría dentro de %s sobre ${ARCH}
it: ${FILE} dovrebbe essere in %s su ${ARCH}

source: changed setuid/setgid;
es: cambiado setuid/setgid;
it: cambiato setuid/setgid;

source: became a directory;
es: convertido en un directorio;
it: diventato una directory;

source: became a character device;
es: convertido en un dispositivo de carácter;
it: diventato un dispositivo a caratteri;

source: became a block device;
es: convertido en un dispositivo de bloque;
it: diventato un dispositivo a blocchi;

source: became a regular file;
es: convertido en archivo usual;
it: diventato un file regolare;

source: became a FIFO;
es: convertido en FIFO;
it: diventato una FIFO;

source: became a symbolic link;
es: convertido en enlace simbólico;
it: diventato un collegamento simbolico;

source: became a socket;
es: convertido en zócalo;
it: diventato un socket;

source: permissions
es: permisos
it: permessi

source: relaxed
es: relajado
it: rilassati

source: changed
es: cambiado
it: cambiati

source: %s from %04o to %04o on %s
es: %s desde %04o a %04o en %s
it: %s da %04o a %04o su %s

source: ${FILE} permissions from %04o to %04o on ${ARCH}
es: ${FILE} con permisos desde %04o hasta %04o en ${ARCH}
it: permessi ${FILE} da %04o a %04o su ${ARCH}

source: %s (%s) is world-writable on %s
es: %s (%s) es escribible por todos en %s
it: %s (%s) è scrivibile da tutti (world-writable) su %s

source: ${FILE} is world-writable on ${ARCH}
es: ${FILE} es escribible por todos sobre ${ARCH}
it: ${FILE} è scrivibile da tutti (world-writable) su ${ARCH}

source: *** invalid politics entry with pattern=%s and digest=%s
es: *** apunte de normativas inválidas con pattern=%s y digest=%s
it: *** voce politics non valida con pattern=%s e digest=%s

source: *** unknown digest type for pattern %s: %s
es: *** tipo digest desconocido para patrón pattern %s: %s
it: *** tipo di digest sconosciuto per pattern %s: %s

source: Possible politically sensitive file (%s) found in %s on %s: rules allow this file.
es: Posible archivo confidencial (%s) encontrado interno a %s en %s: reglas permiten este archivo.
it: Possibile file politicamente sensibile (%s) trovato in %s su %s: le regole consentono questo file.

source: Possible politically sensitive file (%s) found in %s on %s: rules prohibit this file.
es: Posible archivo confidencial (%s) encontrado dentro de %s, sobre %s: reglas prohíben este archivo.
it: Possibile file politicamente sensibile (%s) trovato in %s su %s: le regole proibiscono questo file.

source: ${FILE} is politically sensitive
es: ${FILE} es confidencial
it: ${FILE} è politicamente sensibile

source: ; Removing security policy related files requires inspection by the Security Response Team.
es: ; Quitando política de seguridad relacionada con archivo requiere inspección por el Equipo de Respuesta de Seguridad.
it: ; La rimozione di file relativi alla politica di sicurezza richiede l'ispezione da parte del Security Response Team.

source: library ${FILE} removed on ${ARCH}
es: biblioteca ${FILE} retirada sobre ${ARCH}
it: libreria ${FILE} rimossa su ${ARCH}

source: ABI break: Library %s with SONAME '%s' removed from %s
es: Ruptura de ABI: Biblioteca %s con SONAME '%s' quitada desde %s
it: Rottura ABI: Libreria %s con SONAME '%s' rimossa da %s

source: missing SONAME in ${FILE} on ${ARCH}
es: ausencia SONAME dentro de ${FILE} sobre ${ARCH}
it: SONAME mancante in ${FILE} su ${ARCH}

source: ABI break: Library %s removed from %s
es: Ruptura ABI: biblioteca %s retirada desde %s
it: Rottura ABI: Libreria %s rimossa da %s

source: %s removed from %s
es: %s retirado desde %s
it: %s rimosso da %s

source: Invalid looking %s dependency in the %s package on %s: %s
es: Búsqueda no válida %s dependencia en el paquete %s sobre %s: %s
it: Dipendenza %s dall'aspetto non valido nel pacchetto %s su %s: %s

source: '${FILE}' in %s on ${ARCH}
es: '${FILE}' interna a %s sobre ${ARCH}
it: '${FILE}' in %s su ${ARCH}

source: Subpackage %s on %s carries '%s' which comes from subpackage %s but does not carry an explicit package version requirement. Please add 'Requires: %s = %s' to the spec file to avoid the need to test interoperability between various combinations of old and new subpackages.
it: Il sottopacchetto %s su %s contiene '%s' che proviene dal sottopacchetto %s ma non include un requisito esplicito sulla versione del pacchetto. Si prega di aggiungere 'Requires: %s = %s' al file spec per evitare la necessità di testare l'interoperabilità tra varie combinazioni di sottopacchetti vecchi e nuovi.

source: missing 'Requires: ${FILE} = %s' in %s on ${ARCH}
it: manca 'Requires: ${FILE} = %s' in %s su ${ARCH}

source: Multiple subpackages provide '%s': [%s] but these subpackages carry explicit Requires: [%s]
it: Più sottopacchetti forniscono '%s': [%s] ma questi sottopacchetti hanno Requires espliciti: [%s]

source: %s all provide '${FILE}' on ${ARCH}
it: %s forniscono tutti '${FILE}' su ${ARCH}

source: Missing epoch prefix on the version-release in '%s' for %s on %s
it: Prefisso epoch mancante nella versione-rilascio in '%s' per %s su %s

source: '${FILE}' needs epoch in %s on ${ARCH}
it: '${FILE}' necessita di epoch in %s su ${ARCH}

source: spec file
it: file spec

source: Gained '%s' in source package %s
it: Acquisito '%s' nel pacchetto sorgente %s

source: Gained '%s' in subpackage %s on %s
it: Acquisito '%s' nel sottopacchetto %s su %s

source: Retained '%s' in source package %s
it: Mantenuto '%s' nel pacchetto sorgente %s

source: Retained '%s' in subpackage %s on %s
it: Mantenuto '%s' nel sottopacchetto %s su %s

source: Changed '%s' to '%s' in source package %s
it: Cambiato '%s' in '%s' nel pacchetto sorgente %s

source: Changed '%s' to '%s' in subpackage %s on %s
it: Cambiato '%s' in '%s' nel sottopacchetto %s su %s

source: '%s' became '${FILE}' in %s on ${ARCH}
it: '%s' diventato '${FILE}' in %s su ${ARCH}

source: ; this is expected
it: ; questo è previsto

source: Lost '%s' in source package %s
it: Perso '%s' nel pacchetto sorgente %s

source: Lost '%s' in subpackage %s on %s
it: Perso '%s' nel sottopacchetto %s su %s

source: *** unable to compile $ORIGIN root prefix regular expression: %s
es: *** no es capaz de compilar raíz $ORIGIN prefija de expresión regular: %s
it: *** impossibile compilare l'espressione regolare del prefisso radice $ORIGIN: %s

source: %s has an invalid-looking %s on %s: %s
es: %s tiene una apariencia inválida %s sobre %s: %s
it: %s ha un %s dall'aspetto non valido su %s: %s

source: runtime search path in ${FILE} on ${ARCH}
it: percorso di ricerca runtime in ${FILE} su ${ARCH}

source: both DT_RPATH and DT_RUNPATH in ${FILE} on ${ARCH}
it: sia DT_RPATH che DT_RUNPATH in ${FILE} su ${ARCH}

source: %s has both DT_RPATH and DT_RUNPATH on %s; this is not allowed
it: %s ha sia DT_RPATH che DT_RUNPATH su %s; questo non è permesso

source: invalid shell script ${FILE} on ${ARCH}
it: script di shell non valido ${FILE} su ${ARCH}

source: %s is a shell script but was not before on %s
it: %s è uno script di shell ma non lo era prima su %s

source: %s is a %s script but was a %s script before on %s
it: %s è uno script %s ma prima era uno script %s su %s

source: %s is no longer a valid %s script on %s
it: %s non è più uno script %s valido su %s

source: %s became a valid %s script on %s
it: %s è diventato uno script %s valido su %s

source: . The script fails with '-n' but passes with '-O extglob'; be sure 'shopt extglob' is set in the script.
it: . Lo script fallisce con '-n' ma passa con '-O extglob'; assicurarsi che 'shopt extglob' sia impostato nello script.

source: %s is not a valid %s script on %s
it: %s non è uno script %s valido su %s

source: %s fails with '-n' but passes with '-O extglob'; be sure 'shopt extglob' is set in the script on %s
it: %s fallisce con '-n' ma passa con '-O extglob'; assicurarsi che 'shopt extglob' sia impostato nello script su %s

source: unexpected spec filename
it: nome file spec imprevisto

source: exactly match
it: corrispondere esattamente

source: begin with
es: comienza con
it: iniziare con

source: end with
es: finaliza con
it: finire con

source: Spec filename does not %s the primary name %s; got '%s'
it: Il nome del file Spec non %s il nome primario %s; ottenuto '%s'

source: The specname inspection is only for source packages, skipping.
es: La inspección de specname solo es para paquetes fuentes, se hace caso omiso.
it: L'ispezione specname è solo per i pacchetti sorgente, salto.

source: Subpackage '%s' has disappeared on '%s'
it: Il sottopacchetto '%s' è scomparso su '%s'

source: subpackage ${FILE}
it: sottopacchetto ${FILE}

source: Subpackage '%s' has appeared on '%s'
it: Il sottopacchetto '%s' è apparso su '%s'

source: Directory %s became a symbolic link (to %s) in %s on %s; this is not allowed!
it: La directory %s è diventata un collegamento simbolico (a %s) in %s su %s; questo non è permesso!

source: %s %s became a symbolic link (to %s) in %s on %s
it: %s %s è diventato un collegamento simbolico (a %s) in %s su %s

source: ${FILE} became a symlink on ${ARCH}
it: ${FILE} è diventato un collegamento simbolico su ${ARCH}

source: unable to read symlink ${FILE} on ${ARCH}
it: impossibile leggere il collegamento simbolico ${FILE} su ${ARCH}

source: An error occurred reading symbolic link %s in %s on %s.
it: Si è verificato un errore durante la lettura del collegamento simbolico %s in %s su %s.

source: %s %s has too many levels of redirects and cannot be resolved in %s on %s
it: %s %s ha troppi livelli di reindirizzamento e non può essere risolto in %s su %s

source: too many redirects for ${FILE} on ${ARCH}
it: troppi reindirizzamenti per ${FILE} su ${ARCH}

source: %s %s %s a dangling symbolic link in %s on %s
it: %s %s %s un collegamento simbolico orfano (dangling) in %s su %s

source: dangling symlink ${FILE} on ${ARCH}
it: collegamento simbolico orfano ${FILE} su ${ARCH}

source: ${FILE} MIME type on ${ARCH}
it: tipo MIME di ${FILE} su ${ARCH}

source: Unknown MIME type `%s' on %s in %s
it: Tipo MIME sconosciuto `%s' su %s in %s

source: MIME type for %s in %s was `%s/%s' and became `%s/%s'
it: Il tipo MIME per %s in %s era `%s/%s' ed è diventato `%s/%s'

source: %s is a valid udev rules file on %s
it: %s è un file di regole udev valido su %s

source: %s is now a valid udev rules file on %s
it: %s è ora un file di regole udev valido su %s

source: %s is no longer a valid udev rules file on %s
it: %s non è più un file di regole udev valido su %s

source: %s is not a valid udev rules file on %s
it: %s non è un file di regole udev valido su %s

source: *** empty localpath on %s
es: *** ruta local localpath vacía en %s
it: *** localpath vuoto su %s

source: forbidden code point in ${FILE} on ${ARCH}
it: punto di codice vietato in ${FILE} su ${ARCH}

source: A forbidden code point, 0x%04X, was found in the %s source file on line %ld at column %ld. This source file is used by %s.
it: È stato trovato un punto di codice vietato, 0x%04X, nel file sorgente %s alla riga %ld colonna %ld. Questo file sorgente è usato da %s.

source: unable to run %prep in ${FILE}
it: impossibile eseguire %prep in ${FILE}

source: Unable to run through the %%prep section in %s or manually unpack sources for further scanning.
it: Impossibile eseguire la sezione %%prep in %s o decomprimere manualmente i sorgenti per ulteriori scansioni.

source: The unicode inspection is only for source packages, skipping.
it: L'ispezione unicode è solo per i pacchetti sorgente, salto.

source: New upstream source file `%s` appeared
it: È apparso un nuovo file sorgente upstream `%s`

source: new source file ${FILE}
it: nuovo file sorgente ${FILE}

source: Upstream source file `%s` changed content
it: Il file sorgente upstream `%s` ha cambiato contenuto

source: checksum of ${FILE}
es: comprobante sumatorio de ${FILE}
it: checksum di ${FILE}

source: Source file `%s` removed
es: Archivo fuente `%s` quitado
it: File sorgente `%s` rimosso

source: source file ${FILE} removed
es: archivo fuente ${FILE} quitado
it: file sorgente ${FILE} rimosso

source: *** cl_engine_new returned NULL, check clamav library
es: *** cl_engine_new devolvió NULL, compruebe la biblioteca clamav
it: *** cl_engine_new ha restituito NULL, controllare la libreria clamav

source: Virus detected in %s in the %s package on %s: %s
es: Virus detectado en %s dentro del paquete %s en %s: %s
it: Virus rilevato in %s nel pacchetto %s su %s: %s

source: clamav version information
es: información de la versión de clamav
it: informazioni sulla versione di clamav

source: clamav version %s
es: versión clamav %s
it: versione clamav %s

source: *** missing %s
es: *** ausentando %s
it: *** manca %s

source: %s version %u (%s)
es: %s versión %u (%s)
it: %s versione %u (%s)

source: virus or malware in ${FILE} on ${ARCH}
es: virus o malware dentro de ${FILE} en ${ARCH}
it: virus o malware in ${FILE} su ${ARCH}

source: %s is a well-formed XML file in %s on %s, but is not a valid XML file
es: %s es un archivo XML bien-formado dentro de %s en %s, pero no es un archivo XML válido
it: %s è un file XML ben formato in %s su %s, ma non è un file XML valido

source: %s is not a well-formed XML file in %s on %s
es: %s no es un archivo XML bien formado interno a %s en %s
it: %s non è un file XML ben formato in %s su %s

source: ${FILE} is not well-formed XML on ${ARCH}
es: ${FILE} no es un XML bien formado sobre ${ARCH}
it: ${FILE} non è XML ben formato su ${ARCH}

source: *** XML-RPC Fault: %s (%d)
es: *** Fallo XML-RPC: %s (%d)
it: *** Errore XML-RPC: %s (%d)

source: *** xmlrpc fault code %s (%d): getBuild(%s) from %s
es: *** código %s ausente de xmlrpc (%d): getBuild(%s) desde %s
it: *** codice errore xmlrpc %s (%d): getBuild(%s) da %s

source: *** Koji build state is %s for %s, cannot continue
es: *** Compilación Koji con estado %s para %s, no puede continuar
it: *** Lo stato della compilazione Koji è %s per %s, impossibile continuare

source: *** xmlrpc fault code %s (%d): getTaskInfo(%s) from %s
es: *** código %s ausente de xmlrpc (%d): getTaskInfo(%s) desde %s
it: *** codice errore xmlrpc %s (%d): getTaskInfo(%s) da %s

source: *** Koji task state is %s for task %s, cannot continue
es: *** Estado de tarea Koji es %s para tarea %s, no puede continuar
it: *** Lo stato del task Koji è %s per il task %s, impossibile continuare

source: RPM package build
es: Paquete compilado RPM
it: Compilazione pacchetto RPM

source: Module build consisting of multiple RPM package builds
es: Módulo compilado consistente de múltiples paquetes RPM compilados
it: Compilazione modulo composta da più compilazioni di pacchetti RPM

source: *** unable to initialize the magic library
es: *** no es capaz de inicializar la biblioteca mágica
it: *** impossibile inizializzare la libreria magic

source: *** unable to load the magic database: %s
es: *** no es capaz de cargar la base de datos mágica: %s
it: *** impossibile caricare il database magic: %s

source: *** unable to mkdir %s
es: *** no es capaz de ejecutar mkdir %s
it: *** impossibile creare la directory (mkdir) %s

source: Detailed results suitable for the console and piping through paging programs.
it: Risultati dettagliati adatti per la console e l'invio tramite programmi di paginazione.

source: Results organized as a JSON data structure suitable for reading by web applications and other frontend tools.
it: Risultati organizzati come una struttura dati JSON adatta alla lettura da parte di applicazioni web e altri strumenti frontend.

source: Results organized as an XUnit data structure suitable for use with Jenkins and other XUnit-enabled services.
it: Risultati organizzati come una struttura dati XUnit adatta all'uso con Jenkins e altri servizi abilitati a XUnit.

source: Results summarized with one result per line, suitable for console viewing with a paging program.
it: Risultati riassunti con un risultato per riga, adatti alla visualizzazione su console con un programma di paginazione.

source: *** error opening %s for writing
es: *** error al abrir %s para escribir
it: *** errore nell'apertura di %s per la scrittura

source: added
es: añadido
it: aggiunto

source: removed
es: eliminado
it: rimosso

source: changed
es: cambiado
it: modificato

source: unknown
es: desconocido
it: sconosciuto

source: Result: %s
es: Resultado: %s
it: Risultato: %s

source: Waiver Authorization: %s
es: Autorización Waiver: %s
it: Autorizzazione esenzione: %s

source: Details: %s
es: Detalles: %s
it: Dettagli: %s

source: Suggested Remedy: %s
es: Remedio sugerido: %s
it: Rimedio suggerito: %s

source: *** opening %s for writing
es: *** abriendo %s para escribir
it: *** apertura di %s per la scrittura

source: *** %s: broken document
es: *** %s: documento roto
it: *** %s: documento danneggiato

source: *** skipping token type %s
es: *** se descarta tipo de vale %s
it: *** salto il tipo di token %s

source: *** malformed type - freed?
es: *** tipo malformado - ¿liberado?
it: *** tipo malformato - liberato?

source: There is not enough available space to unpack all of the RPMs.
es: No hay suficiente espacio disponible para desempaquetar todo el RPMs.
it: Non c'è abbastanza spazio disponibile per decomprimere tutti gli RPM.

source: *** unknown elftype_t %d
es: *** elftype_t %d desconocido
it: *** elftype_t sconosciuto %d

source: *** libelf version mismatch
es: *** no coincide la versión libelf
it: *** Mismatch versione libelf

source: *** unable to find end of %s
es: *** no es capaz de encontrar el final de %s
it: *** impossibile trovare la fine di %s

source: *** unable to close %s
es: *** no es capaz de cerrar %s
it: *** impossibile chiudere %s

source: *** %s is not a directory
es: *** %s no es un directorio
it: *** %s non è una directory

source: *** Fopen failed for %s: %s
es: *** Fopen incorrecto para %s: %s
it: *** Fopen fallito per %s: %s

source: *** file index %d is out of bounds for %s
es: *** índice de archivo %d está fuera de acotaciones para %s
it: *** indice file %d fuori dai limiti per %s

source: *** error reading file from RPM payload
es: *** error al leer archivo desde carga útil RPM: %s
it: *** errore durante la lettura del file dal payload RPM

source: %s %s tried to run the command and it received signal %s
es: %s %s intentado para ejecutar la instrucción y recibió señal %s
it: %s %s ha provato ad eseguire il comando e ha ricevuto il segnale %s

source: %s tried to run the command and it received signal %s
es: %s intentado para ejecutar la instrucción y recibía la señal %s
it: %s ha provato ad eseguire il comando e ha ricevuto il segnale %s

source: VERIFY
es: VERIFICAR
it: VERIFICA

source: BAD
it: NEGATIVO

source: SKIP
es: OMITIR
it: SALTA

source: DIAGNOSTICS
es: DIAGNÓSTICOS
it: DIAGNOSTICA

source: UnKnOwN
es: DeScOnOcIdO
it: Sconosciuto

source: Not Waivable
es: No Renunciable
it: Non Esentabile

source: Anyone
es: Cualquiera
it: Chiunque

source: Security
es: Seguridad
it: Sicurezza

source: regular file
es: archivo usual
it: file regolare

source: character device
es: dispositivo de carácter
it: dispositivo a caratteri

source: block device
es: dispositivo de bloque
it: dispositivo a blocchi

source: FIFO (named pipe)
es: FIFO (llamado conducto)
it: FIFO (pipe nominata)

source: symbolic link
es: enlace simbólico
it: collegamento simbolico

source: Success.
es: Logrado.
it: Successo.

source: One or more inspections failed.
es: Una o más inspecciones incorrectas.
it: Una o più ispezioni fallite.

source: Program error.
es: Error de programa.
it: Errore del programma.

source: The specified profile is not found.
es: El perfil especificado no es encontrado.
it: Il profilo specificato non è stato trovato.

source: Insufficient disk space in the working directory.
es: Espacio de disco insuficiente en el pupitre.
it: Spazio su disco insufficiente nella directory di lavoro.

source: Compare package builds for policy compliance and consistency.
es: Compare compilaciones del paquete para cumplimiento de normativa y consistencia.
it: Confronta le build dei pacchetti per la conformità alle policy e la coerenza.

source: Usage: %s [OPTIONS] [before build] [after build]
es: Modo de empleo: %s [OPCIONES] [antes de compilar] [después de compilar]
it: Utilizzo: %s [OPZIONI] [build precedente] [build successiva]

source: Options:
es: Opciones:
it: Opzioni:

source: -c FILE, --config=FILE Configuration file to use
es: -c ARCHIVO, --config=ARCHIVO Archivo de configuración para utilizar
it: -c FILE, --config=FILE File di configurazione da usare

source: -p NAME, --profile=NAME Configuration profile to use
es: -p NOMBRE, --profile=NOMBRE Perfil de compilación a utilizar
it: -p NOME, --profile=NOME Profilo di configurazione da usare
