Repository: rpminspect/rpminspect-l10n
Catalog: *.po
Languages: es, it

source: Verify the string specified in the License tag of the RPM metadata describes permissible software licenses as defined by the license database. Also checks to see if the License tag contains any unprofessional words as defined in the configuration file.
es: Verifica la cadena especificada dentro de la License etiquetada de los metadatos de RPM descritos son permisibles las licencias del software como definió por la base de datos de licencia. Además comprueba consultar si la etiqueta de License contiene cualquier palabra no profesional como definía en el archivo de configuración.
it: Verificare che la stringa specificata nel tag di License dei metadati RPM descriva le License software consentite come definito dal database delle licenze. Controlla anche se il tag di License contiene parole non professionali come definito nel file di configurazione.

source: Check all binary RPMs in the build for any empty payloads. When comparing two builds, report new packages in the after build with empty payloads.
es: Compruebe todos los RPMs binarios en la compilación para cualquier carga útil vacía. Cuándo comparar dos compilaciones, informe paquetes nuevos dentro de la compilación posterior con carga útil vacía.
it: Controlla tutti gli RPM binari nella build per eventuali payload vuoti. Quando si confrontano due build, segnala i nuovi pacchetti nella build successiva con payload vuoti.

source: Check all binary RPMs in the before and after builds for any empty payloads. Packages that lost payload data from the before build to the after build are reported.
es: Comprueba todos los RPM binarios dentro antes y después de compilaciones por cualquier carga útil de datos desde la compilación anterior para la compilación posterior sea informada.
it: Controlla tutti gli RPM binari nelle build precedenti e successive per eventuali payload vuoti. Vengono segnalati i pacchetti che hanno perso i dati del payload dalla build precedente a quella successiva.

source: Perform some RPM header checks. First, check that the Vendor contains the expected string as defined in the configuration file. Second, check that the build host is in the expected subdomain as defined in the configuration file. Third, check the Summary string for any unprofessional words. Fourth, check the Description for any unprofessional words. Lastly, if there is a before build specified, check for differences between the before and after build values of the previous RPM header values and report them.
es: Actúa algunas comprobaciones de cabecera de RPM. Primero, comprueba que el proveedor Vendor contiene la cadena esperada como esté definida en el archivo de configuración. Segundo, comprueba que el host anfitrión está dentro del subdominio esperado como está definido en el archivo de configuración. Tercero, comprobar la cadena Summary para cualquier palabra no profesional. Cuarto, comprobar en Description cualquier palabra no profesional. Finalmente, si hay antes una compilación especificada, compruebe las diferencias de valores en el anterior y el posterior tras los valores de compilación de los valores precios de cabecera RPM e informarlos.
it: Esegui alcuni controlli dell'intestazione RPM. Per prima cosa controlla che il Vendor contenga la stringa prevista come definita nel file di configurazione. In secondo luogo, controlla che l'host di compilazione si trovi nel sottodominio previsto come definito nel file di configurazione. In terzo luogo, controlla la stringa Riepilogo per eventuali parole non professionali. In quarto luogo, controlla la descrizione per eventuali parole non professionali. Infine, se è specificata una build precedente, verificare le differenze tra i valori di build prima e dopo i valori dell'intestazione RPM precedenti e segnalarle.

source: Perform some checks on man pages in the RPM payload. First, check that each man page is compressed. Second, check that each man page contains valid content. Lastly, check that each man page is installed to the correct path.
es: Realiza algunas comprobaciones sobre las páginas man dentro de la carga útil del RPM. Primero, compruebe que cada página man esté comprimida. Segundo, compruebe que cada página man contenga contenido válido. Finalmente, compruebe que cada página man esté instalada en la ruta correcta.
it: Esegui alcuni controlli sulle pagine man nel payload RPM. Innanzitutto, controlla che ogni pagina man sia compressa. In secondo luogo, controlla che ogni pagina man contenga contenuti validi. Infine, controlla che ogni pagina man sia installata nel percorso corretto.

source: Check that XML files included in the RPM payload are well-formed.
es: Compruebe que los archivos #XML incluidos dentro de la carga útil de RPM están bien-formados.
it: Controlla che i file XML inclusi nel payload RPM siano formati correttamente.

source: Perform several checks on ELF files. First, check that ELF objects do not contain an executable stack. Second, check that ELF objects do not contain text relocations. When comparing builds, check that the ELF objects in the after build did not lose a PT_GNU_RELRO segment. When comparing builds and there is a list of forbidden library functions, make sure nothing uses them.
es: Realiza varias comprobaciones sobre archivos ELF. Primero, comprueba que los objetos ELF no contengan una pila ejecutable. Segundo, comprueba que los objetos ELF no contentan texto reubicados. Cuándo compara compilaciones, comprueba que los objetos ELF dentro de la compilación posterior no pierda un segmento PT_GNU_RELRO. Cuando compare compilaciones y hay un listado de funciones de biblioteca prohibida, asegúrese que nada les utiliza.
it: Esegui diversi controlli sui file ELF. Innanzitutto, controlla che gli oggetti ELF non contengano uno stack eseguibile. In secondo luogo, controlla che gli oggetti ELF non contengano rilocazioni di testo. Quando si confrontano le build, verificare che gli oggetti ELF nella build successiva non abbiano perso un segmento PT_GNU_RELRO. Quando confronti le build e c'è un elenco di funzioni di libreria proibite, assicurati che nulla le utilizzi.

source: Perform syntax and file reference checks on *.desktop files. Syntax errors and invalid file references are reported as errors.
es: Realiza comprobaciones de sintaxis y referencia en archivos *.desktop. Errores de sintaxis y referencias de archivo no válido están informados como errores.
it: Esegui controlli di sintassi e riferimenti ai file sui file *.desktop. Gli errori di sintassi e i riferimenti a file non validi vengono segnalati come errori.

source: Check that the 'Release' tag in the RPM spec file includes the %{?dist} directive.
es: Comprueba que el etiquetado 'Release' dentro del archivo específico de RPM incluye la directiva %{?dist}.
it: Controlla che il tag 'Release' nel file delle specifiche RPM includa la direttiva %{?dist}.

source: Ensure the spec file name conforms to the NAME.spec naming format.
es: Asegura que el nombre spec de archivo conforma al formato de nombre NOMBRE.spec.
it: Assicurarsi che il nome del file spec sia conforme al formato di denominazione NAME.spec.

source: Ensure compliance with modularity build and packaging policies (only valid for module builds, no-op otherwise).
es: Asegura conformidad con modularidad en normativas de compilación y empaquetado (solo válidos para compilaciones de módulo, no-op en otro caso).
it: Garantire la conformità con le politiche di creazione e confezionamento della modularità (valido solo per le build dei moduli, altrimenti nessuna operazione).

source: Check minimum required Java bytecode version in class files, report bytecode version changes between builds, and report if bytecode versions are exceeded. The bytecode version is vendor specific to releases and defined in the configuration file.
es: Controla la versión mínima del bytecode Java requerido en archivos de clase, informa los cambios de versión del bytecode entre compilaciones, e informa si las versiones de bytecode son superadas. La versión bytecode es específica del proveedor para despliegues y definidos dentro del archivo de configuración.
it: Controlla la versione minima del bytecode Java richiesta nei file di classe, segnala le modifiche alla versione del bytecode tra le build e segnala se le versioni del bytecode vengono superate. La versione del bytecode è specifica del fornitore per le versioni e definita nel file di configurazione.

source: Report changed files from the before build to the after build. Certain file changes will raise additional warnings if the concern is more critical than just reporting changes (e.g., a suspected security impact). Any gzip, bzip2, or xz compressed files will have their uncompressed content compared only, which will allow changes through in the compression level used. Message catalog files (.mo) are unpacked and compared using diff(1). Public C and C++ header files are preprocessed and compared using diff(1). Any changes with diff output are included in the results.
es: El informe cambió archivos desde la compilación anterior a la compilación posterior. Ciertos cambios de archivo elevarán avisos adicionales si el concierto es más crítico que tan solo informar cambios (p.ej., un impacto de seguridad sospechoso). Cualquier archivo comprimido con gzip, bzip2, o xz tendrán su contenido descomprimido solo comparado, lo cual permitirá cambiar a lo largo del nivel de compresión utilizado. Los archivos del catálogo de mensaje (.mo) son desempaquetados y comparados utilizando diff(1). Los archivos de cabecera públicos de C y C++ son pre-procesados y compilados utilizando diff(1). Cualquier cambio con la salida diff son incluidos dentro del resultado.
it: Segnala i file modificati dalla build precedente a quella successiva. Alcune modifiche ai file genereranno ulteriori avvisi se la preoccupazione è più critica della semplice segnalazione delle modifiche (ad esempio, un sospetto impatto sulla sicurezza). Per qualsiasi file compresso gzip, bzip2 o xz verrà confrontato solo il contenuto non compresso, il che consentirà modifiche nel livello di compressione utilizzato. I file del catalogo dei messaggi (.mo) vengono decompressi e confrontati utilizzando diff(1). I file di intestazione pubblici C e C++ vengono preelaborati e confrontati utilizzando diff(1). Qualsiasi modifica con l'output differenziale viene inclusa nei risultati.

source: Report files that have moved installation paths or across subpackages between builds. Files moved with a security path prefix generate special reporting in case a security review is required. Rebased packages report these findings at the INFO level while non-rebased packages report them at the VERIFY level or higher.
es: Los archivos del informe que ha movido rutas de instalación o cruza subpaquetes entre compilaciones. Los archivos movidos con un prefijo de ruta de seguridad genera informes espacial informando en caso una revisión de seguridad está requerido. Informa paquetes rebasados estros se encuentran en el nivel INFO mientras los informa paquetes no rebasados en el nivel VERIFY o más alto.
it: Segnala i file che hanno spostato percorsi di installazione o tra pacchetti secondari tra build. I file spostati con un prefisso del percorso di sicurezza generano report speciali nel caso in cui sia richiesta una revisione della sicurezza. I pacchetti ribasati riportano questi risultati al livello INFO mentre i pacchetti non ribasati li riportano al livello VERIFY o superiore.

source: Report removed files from the before build to the after build. Shared libraries get additional reporting output as they may be unexpected dependency removals. Files removed with a security path prefix generate special reporting in case a security review is required. Source RPMs and debuginfo files are ignored by this inspection. Rebased packages report these findings at the INFO level while non-rebased packages report them at the VERIFY level or higher.
es: Los archivos retirados del informa antes de la compilación a la compilación posterior. Las bibliotecas compartidas obtienen salida de informe adicional como pueda ser retiradas inesperadas de dependencias. Los archivos retirados con una ruta prefija de seguridad genera informes especial en caso de revisión de seguridad es requerida. Los RPM de fuentes y los archivos debuginfo son descartados por esta inspección. Los paquetes rebasados informar estos encontrados en el nivel INFO mientras que los paquetes no rebasados informan estos al nivel VERIFY o más alto.
it: Segnala i file rimossi dalla build precedente a quella successiva. Le librerie condivise ricevono output di reporting aggiuntivi poiché potrebbero trattarsi di rimozioni di dipendenze impreviste. I file rimossi con un prefisso del percorso di sicurezza generano report speciali nel caso in cui sia necessaria una revisione della sicurezza. Gli RPM di origine e i file debuginfo vengono ignorati da questa ispezione. I pacchetti ribasati riportano questi risultati al livello INFO mentre i pacchetti non ribasati li riportano al livello VERIFY o superiore.

source: Report added files from the before build to the after build. Debuginfo files are ignored as are files that match the patterns defined in the configuration file. Files added to security paths generate special reporting in case a security review is required. New setuid and setgid files raise a security warning unless the file is in the fileinfo list. Rebased packages report these findings at the INFO level while non-rebased packages report them at the VERIFY level or higher.
es: Informa archivos añadidos desde la compilación anterior para la compilación posterior. Los archivos de Debuginfo son descartados al igual que coinciden los patrones definidos dentro del archivo de configuración. Los archivos añadidos para rutas de seguridad generan informes especiales en caso de ser requerida una revisión de seguridad. Los setuid y setgid de los archivos aumentan un aviso de seguridad a no ser que el archivo esté dentro del listado de fileinfo. El informe de esos paquetes rebasados son encontrados en el nivel INFO mientras que el informe de paquetes no-rebasados se encuentran en el nivel VERIFY o más alto.
it: Segnala i file aggiunti dalla build precedente a quella successiva. I file debuginfo vengono ignorati così come i file che corrispondono ai modelli definiti nel file di configurazione. I file aggiunti ai percorsi di sicurezza generano report speciali nel caso in cui sia necessaria una revisione della sicurezza. I nuovi file setuid e setgid generano un avviso di sicurezza a meno che il file non sia nell'elenco fileinfo. I pacchetti ribasati riportano questi risultati al livello INFO mentre i pacchetti non ribasati li riportano al livello VERIFY o superiore.

source: Report Source archives defined in the RPM spec file changing content between the before and after build. If the source archives change and the package is on the rebaseable list, the change is reported as informational. Otherwise the change is reported as a rebase of the package and requires inspection.
es: Archivadores de informe origen (Source) definido en el archivo spec de RPM cambia el contenido entre la compilación anterior y posterior. Si los archivadores fuentes cambian y el paquete están sobre el listado rebasable el cambio es informado como informacional. En otro caso el cambio es informado como un rebase del paquete y requiere inspección.
it: Archivi Source report definiti nel file delle specifiche RPM che modificano il contenuto tra la build prima e dopo. Se gli archivi di origine cambiano e il pacchetto è nell'elenco riutilizzabile, la modifica viene segnalata come informativa. In caso contrario la modifica viene segnalata come rebase del pacco e necessita di ispezione.

source: Report files and directories owned by unexpected users and groups. Check to make sure executables are owned by the correct user and group. If a before and after build have been specified, also report ownership changes.
es: Informa archivos y directorios poseídos por usuarios y grupos inesperados. Compruebe para asegurar ejecutables sean propiedad por el usuario y grupo correcto. Si ha sido especificada un anterior y posterior compilación, además informa cambios de posesión.
it: Segnala file e directory di proprietà di utenti e gruppi imprevisti. Verificare che i file eseguibili siano di proprietà dell'utente e del gruppo corretti. Se è stata specificata una build prima e dopo, segnala anche i cambiamenti di proprietà.

source: For all shell scripts in the build, perform a syntax check on it using the shell defined in its #! line (shell must also be listed in shell section of the configuration data). If the syntax check returns non-zero, report it to the user and return a combined stdout and stderr. If comparing two builds, perform the previous check but also report if a previously bad script is now passing the syntax check.
es: Para todos guiones del intérprete en la compilación, realiza una comprobación sintáctica en esto utilizando el intérprete definido en su línea #! (el intérprete además está listado en la sección del intérprete de los datos de configuración). Si la comprobación sintáctica devuelve algo distinto de cero, lo informa al usuario y devuelve un stdout y stderr combinado. Si compara dos compilaciones, realiza la comprobación actuar pero además informa si un guion previamente incorrecto ahora está pasando la comprobación de sintaxis.
it: Per tutti gli script di shell nella build, esegui un controllo della sintassi utilizzando la shell definita nel suo #! (la shell deve essere elencata anche nella sezione shell dei dati di configurazione). Se il controllo della sintassi restituisce un valore diverso da zero, segnalalo all'utente e restituisce uno stdout e stderr combinati. Se si confrontano due build, eseguire il controllo precedente ma segnalare anche se uno script precedentemente errato ora supera il controllo della sintassi.

source: Perform annocheck tests defined in the configuration file on all ELF files in the build. A single build specified will perform an analysis only. Two builds specified will compare the test results between the before and after build. If no annocheck tests are defined in the configuration file, this inspection is skipped.
es: Realiza pruebas annocheck definidas en el archivo de configuración sobre todos los archivos ELF dentro de la compilación. Una única compilación especificada realizará solo un análisis. Dos compilaciones especificadas compararán los resultados de test entre la anterior y la posterior compilación. Si no está definido ningún test annocheck dentro del archivo de configuración, esta inspección es omitida.
it: Esegui test annocheck definiti nel file di configurazione su tutti i file ELF nella build. Una singola build specificata eseguirà solo un'analisi. Due build specificate confronteranno i risultati del test tra la build prima e dopo. Se nel file di configurazione non sono definiti test annocheck, questa ispezione viene saltata.

source: Compare DT_NEEDED entries in dynamic ELF executables and shared libraries between the before and after build and report changes.
es: Compara apuntes DT_NEEDED en ejecutables ELF dinámicos y bibliotecas compartidas entre la los cambios de compilación anterior y posterior.
it: Confronta le voci DT_NEEDED negli eseguibili ELF dinamici e nelle librerie condivise tra la compilazione prima e dopo e segnala le modifiche.

source: Report file size changes between builds. If empty files became non-empty or non-empty files became empty, report those as results needing verification. Report file change percentages as info-only.
es: Informa el cambio de tamaño del archivo entre compilaciones. Si los archivos vacíos se vuelven no vacíos o los archivos no vacíos se vuelven vacíos, informa esos como resultado necesitando verificación. Archivo de informe cambia porcentajes como solo-informe.
it: Segnala le modifiche alle dimensioni del file tra le build. Se i file vuoti sono diventati non vuoti o i file non vuoti sono diventati vuoti, segnalali come risultati che necessitano di verifica. Segnala le percentuali di modifica dei file come solo informazioni.

source: Report stat(2) mode changes between builds. Checks against the fileinfo list for the product release specified or determined. Any setuid or setgid changes will raise a message requiring Security Team review.
es: Informa cambios del modo stat(2) entre compilaciones. Comprueba frente al listado fileinfo para la publicación del producto especificado o determinado. Cualquier cambio de setuid o setgid elevará un mensaje requiriendo revisión de Equipo de Seguridad.
it: Segnala le modifiche alla modalità stat(2) tra le build. Verifica il fileinfo per la versione del prodotto specificata o determinata. Qualsiasi modifica a setuid o setgid genererà un messaggio che richiede la revisione da parte del team di sicurezza.

source: Report capabilities(7) changes between builds. Checks against the capabilities list for the product release specified or determined. Any capabilities changes not listed will raise a message requiring Security Team review.
es: Informa cambios en capabilities(7) entre compilaciones. Comprueba frente al listado de capacidades para la publicación del producto especificado o determinado. Cualquier cambio de capacidades no listadas elevará un mensaje requiriendo revisión de Security Team.
it: Segnala le modifiche delle funzionalità(7) tra le build. Verifica rispetto all'elenco delle funzionalità per la versione del prodotto specificata o determinata. Qualsiasi modifica alle funzionalità non elencata genererà un messaggio che richiede la revisione da parte del team di sicurezza.

source: Report kernel module parameter, dependency, PCI ID, or symbol differences between builds. This inspection is intended as an information gathering tool to gather kernel module differences between two builds.
es: Informa parámetro de módulo del kernel, dependencia, PCI ID, o diferencias de símbolo entre compilaciones. Esta inspección se intente como una información obteniendo herramienta para recolectar diferencias del módulo de kernel entre dos compilaciones.
it: Segnala parametri del modulo kernel, dipendenze, ID PCI o differenze di simboli tra build. Questa ispezione è intesa come uno strumento di raccolta di informazioni per raccogliere le differenze dei moduli del kernel tra due build.

source: Report RPM architectures that appear and disappear between the before and after builds. This inspection does not report the loss of noarch packages. The purpose of this inspection is to report the loss of target machine architectures as provided in the before build and not seeing them in the after build.
es: Informa arquitecturas del RPM que aparece y desaparece entre la anterior y posterior compilaciones. Esta inspección no informa la pérdida de paquetes noarch. El propósito de esta inspección es para informar la pérdida de arquitecturas de máquina destino como proporcionó dentro de la compilación anterior y no viéndolos en la compilación posterior.
it: Segnala le architetture RPM che appaiono e scompaiono tra la build prima e dopo. Questa ispezione non segnala la perdita di pacchetti noarch. Lo scopo di questa ispezione è segnalare la perdita delle architetture delle macchine di destinazione fornite nella build precedente e non vederle nella build successiva.

source: Report RPM subpackages that appear and disappear between the before and after builds.
es: Informa sobre subpaquetes RPM que aparezcan y desaparezcan entre las compilaciones anteriores y posteriores.
it: Segnala i sottopacchetti RPM che appaiono e scompaiono tra la build prima e dopo.
