Repository: rpminspect/rpminspect-l10n
Catalog: *.po
Languages: es, it

source: %s in %s on %s carries unexpected mode %04o; expected mode %04o; requires inspection by the Security Team
es: %s interno a %s en %s porta el modo %04o inesperado; modo esperado %04o; requiere inspección por el Equipo de Seguridad
it: %s in %s su %s ha una modalità inattesa %04o; modalità prevista %04o; richiede ispezione da parte del Team di Sicurezza

source: %s in %s on %s carries insecure mode %04o, Security Team review may be required
es: %s interno a %s en %s porta el modo %04o inseguro, revise Equipo de Seguridad puede ser requerido
it: %s in %s su %s ha una modalità insicura %04o, potrebbe essere richiesta una revisione da parte del Team di Sicurezza

source: %s in %s on %s carries expected owner '%s'
es: %s interno a %s en %s porta el propietario '%s' esperado
it: %s in %s su %s ha il proprietario previsto '%s'

source: %s in %s on %s carries unexpected owner '%s'; expected owner '%s'; requires inspection by the Security Team
es: %s interno a %s en %s porta el propietario '%s' inesperado; propietario esperado '%s'; requiere inspección por el Equipo de Seguridad
it: %s in %s su %s ha un proprietario inatteso '%s'; proprietario previsto '%s'; richiede ispezione da parte del Team di Sicurezza

source: %s in %s on %s carries insecure mode %04o but has no fileinfo rule for owner specification, Security Team review may be required
es: %s interno a %s en %s porta el modo %04o inseguro pero no tiene regla fileinfo para especificación propietario, Equipo de Seguridad puede ser requerido
it: %s in %s su %s ha una modalità insicura %04o ma non ha una regola fileinfo per la specifica del proprietario, potrebbe essere richiesta una revisione da parte del Team di Sicurezza

source: %s in %s on %s carries expected group '%s'
es: %s interno a %s en %s porta el grupo '%s' esperado
it: %s in %s su %s ha il gruppo previsto '%s'

source: %s in %s on %s carries group unexpected '%s'; expected group '%s'; requires inspection by the Security Team
es: %s interno a %s en %s porta el grupo inesperado '%s'; grupo esperado '%s'; requiere inspección por el Equipo de Seguridad
it: %s in %s su %s ha un gruppo inatteso '%s'; gruppo previsto '%s'; richiede ispezione da parte del Team di Sicurezza

source: *** invalid input string `%s`
es: *** cadena `%s` de entrada no válida
it: *** stringa di input non valida `%s`

source: *** invalid mode string: %s
es: *** modo cadena no válido: %s
it: *** stringa modalità non valida: %s

source: *** problem adding entries to array %s->%s
es: *** problema añadiendo apuntes a colección %s→%s
it: *** problema nell'aggiungere voci all'array %s->%s

source: *** problem adding ignore entries to %s
es: *** problema añadiendo apuntes descartados a %s
it: *** problema nell'aggiungere voci di esclusione a %s

source: *** error reading
es: *** error de lectura
it: *** errore durante la lettura

source: *** ignoring malformed section %s->%s
es: *** se descarta sección malformada %s→%s
it: *** ignoro sezione malformata %s->%s

source: *** error reading %s ignore pattern
es: *** error al leer %s descarta patrón
it: *** errore nella lettura del pattern di esclusione %s

source: *** flag must be 'on' or 'off'; ignoring '%s'
es: *** indicador debe ser 'on' u 'off'; se descarta '%s'
it: *** il flag deve essere 'on' o 'off'; ignoro '%s'

source: *** unknown inspections: `%s`
es: *** inspecciones desconocidas: `%s`
it: *** ispezioni sconosciute: `%s`

source: *** malformed/unknown inspections section
es: *** sección de inspecciones malformadas/desconocidas
it: *** sezione ispezioni malformata/sconosciuta

source: *** ignoring malformed %s configuration file: %s
es: *** se descarta archivo de configuración %s malformado: %s
it: *** ignoro file di configurazione %s malformato: %s

source: *** unknown modularity static context settiongs '%s'
es: *** parámetros de contexto estático de modularidad desconocida '%s'
it: *** impostazioni contesto statico modularità sconosciute '%s'

source: *** unknown specname match setting '%s', defaulting to 'full'
es: *** ajuste de coincidencia de specname desconocido '%s', predeterminado a 'full' (completo)
it: *** impostazione corrispondenza specname sconosciuta '%s', uso predefinito 'full'

source: *** unknown specname primary setting '%s', defaulting to 'name'
it: *** impostazione primaria specname sconosciuta '%s', uso predefinito 'name'

source: *** invalid annocheck failure_reporting_level: %s, defaulting to %s
es: *** annocheck no válido failure_reporting_level: %s, predet. a %s
it: *** livello failure_reporting_level di annocheck non valido: %s, uso predefinito %s

source: *** malformed badfuncs->allowed section
es: *** sección badfuncs->allowed malformada
it: *** sezione badfuncs->allowed malformata

source: *** error reading unicode exclude regular expression: %s
es: *** error al leer unicode excluye expresión regular: %s
it: *** errore lettura espressione regolare esclusione unicode: %s

source: *** malformed rpmdeps->ignore section; skipping
es: *** sección rpmdeps->ignore malformada; se descarta
it: *** sezione rpmdeps->ignore malformata; salto

source: *** Invalid filename in the fileinfo list: %s
es: *** nombre de archivo no válido dentro de listado fileinfo: %s
it: *** Nome file non valido nell'elenco fileinfo: %s

source: *** From this invalid line:
es: *** Desde esta línea no válida:
it: *** Da questa riga non valida:

source: *** unexpected token `%s' seen in %s, cannot continue
es: *** vale inesperado ‘%s’ visto en %s, no se puede continuar
it: *** token inatteso `%s' visto in %s, impossibile continuare

source: *** invalid security rule: %s
es: *** regla de seguridad no válida: %s
it: *** regola di sicurezza non valida: %s

source: *** unknown security rule: %s
es: *** regla de seguridad desconocida: %s
it: *** regola di sicurezza sconosciuta: %s

source: *** unknown security action: %s
es: *** desconoce acción de seguridad: %s
it: *** azione di sicurezza sconosciuta: %s

source: *** malformed security line: %s
es: *** línea de seguridad malformada: %s
it: *** riga di sicurezza malformata: %s

source: *** missing configuration file `%s'
es: *** ausentando archivo de configuración `%s'
it: *** file di configurazione mancante `%s'

source: *** unable to find profile '%s'
es: *** no es capaz de encontrar el perfil '%s'
it: *** impossibile trovare il profilo '%s'

source: abidiff usage error
es: error de uso abidiff
it: errore uso abidiff

source: ABI change in ${FILE} on ${ARCH}
es: ABI cambia en ${FILE} sobre ${ARCH}
it: Modifica ABI in ${FILE} su ${ARCH}

source: ABI incompatible change in ${FILE} on ${ARCH}
es: ABI incompatible cambia en ${FILE} sobre ${ARCH}
it: Modifica ABI incompatibile in ${FILE} su ${ARCH}

source: Comparing old vs. new version of %s in package %s with ABI compatibility level %ld on %s revealed ABI differences.
es: Comparando versión antigua vs. nueva de %s en paquete %s con nivel de compatibilidad ABI %ld en %s reveló diferencias de ABI.
it: Confronto tra vecchia e nuova versione di %s nel pacchetto %s con livello di compatibilità ABI %ld su %s ha rivelato differenze ABI.

source: Comparing old vs. new version of %s in package %s on %s revealed ABI differences.
es: Comparando versión antigua vs. nueva de %s interna al paquete %s sobre %s diferencias ABI delatadas.
it: Confronto tra vecchia e nuova versione di %s nel pacchetto %s su %s ha rivelato differenze ABI.

source: Comparing from %s to %s in package %s with ABI compatibility level %ld on %s revealed ABI differences.
es: Comparando desde %s a %s en paquete %s con nivel de compatibilidad ABI %ld sobre %s delató diferencias de ABI.
it: Confronto da %s a %s nel pacchetto %s con livello di compatibilità ABI %ld su %s ha rivelato differenze ABI.

source: Comparing from %s to %s in package %s on %s revealed ABI differences.
es: Comparando desde %s a %s interno a paquete %s sobre %s reveló diferencias ABI.
it: Confronto da %s a %s nel pacchetto %s su %s ha rivelato differenze ABI.

source: Command: %s %s
es: Instrucción: %s %s
it: Comando: %s %s

source: Packages should not contain files or directories starting with `%s` on %s in %s: %s
es: Paquetes no contendrían archivos o directorios iniciando con `%s` en %s dentro de %s: %s
it: I pacchetti non dovrebbero contenere file o directory che iniziano con `%s` su %s in %s: %s

source: invalid directory ${FILE} on ${ARCH}
es: directorio ${FILE} no válido sobre ${ARCH}
it: directory non valida ${FILE} su ${ARCH}

source: Packages should not contain files or directories ending with `%s` on %s in %s: %s
es: Paquetes no contendría archivos o directorios finalizando con `%s` sobre %s en %s: %s
it: I pacchetti non dovrebbero contenere file o directory che finiscono con `%s` su %s in %s: %s

source: Forbidden directory `%s` found on %s in %s: %s
es: Directorio prohibido `%s` encontrado en %s dentro de %s: %s
it: Directory proibita `%s` trovata su %s in %s: %s

source: forbidden directory ${FILE} on ${ARCH}
es: directorio ${FILE} prohibido sobre ${ARCH}
it: directory proibita ${FILE} su ${ARCH}

source: New security-related file `%s` added on %s in %s requires inspection by the Security Team
it: Nuovo file relativo alla sicurezza `%s` aggiunto su %s in %s richiede ispezione da parte del Team di Sicurezza

source: new security-related file ${FILE} on ${ARCH}
it: nuovo file relativo alla sicurezza ${FILE} su ${ARCH}

source: `%s` added on %s in %s
es: `%s` agregado sobre %s en %s
it: `%s` aggiunto su %s in %s

source: new file ${FILE} on ${ARCH}
es: archivo ${FILE} nuevo en ${ARCH}
it: nuovo file ${FILE} su ${ARCH}

source: the fileinfo list
es: el listado fileinfo
it: l'elenco fileinfo

source: NOT RUN
es: NO EJECUTAR
it: NON ESEGUITO

source: PASSED
es: APROBADO
it: SUPERATO

source: FAILED
es: INCORRECTO
it: FALLITO

source: MAYBE
es: QUIZÁ
it: FORSE

source: skipped
es: omitido
it: saltato

source: UNKNOWN
es: DESCONOCIDO
it: SCONOSCIUTO

source: *** before libannocheck_run_tests: %s (%d)
es: *** anterior libannocheck_run_tests: %s (%d)
it: *** prima di libannocheck_run_tests: %s (%d)

source: *** after libannocheck_run_tests: %s (%d)
es: *** tras libannocheck_run_tests: %s (%d)
it: *** dopo libannocheck_run_tests: %s (%d)

source: lost -D_FORTIFY_SOURCE in ${FILE} on ${ARCH}
es: perdió -D_FORTIFY_SOURCE en ${FILE} sobre ${ARCH}
it: perso -D_FORTIFY_SOURCE in ${FILE} su ${ARCH}

source: %s may have lost -O2 -D_FORTIFY_SOURCE on %s
es: %s puede tener pérdida -O2 -D_FORTIFY_SOURCE sobre %s
it: %s potrebbe aver perso -O2 -D_FORTIFY_SOURCE su %s

source: libannocheck '%s' continues passing for %s on %s
es: libannocheck '%s' continúa pasando en %s sobre %s
it: libannocheck '%s' continua a passare per %s su %s

source: libannocheck '%s' test now passes for %s on %s
es: libannocheck '%s' prueba ahora aprobada para %s sobre %s
it: test libannocheck '%s' ora passa per %s su %s

source: libannocheck '%s' test now fails for %s on %s
es: libannocheck '%s' ahora prueba fallos para %s sobre %s
it: test libannocheck '%s' ora fallisce per %s su %s

source: libannocheck '%s' test fails for %s on %s
es: libannocheck '%s' prueba falla para %s sobre %s
it: test libannocheck '%s' fallisce per %s su %s

source: libannocheck '%s' test passes for %s on %s
es: libannocheck '%s' prueba pasada para %s sobre %s
it: test libannocheck '%s' passa per %s su %s

source: annocheck '%s' test passes for %s on %s
it: test annocheck '%s' passa per %s su %s

source: annocheck '%s' test now passes for %s on %s
es: annocheck '%s' prueba ahora pasada para %s sobre %s
it: test annocheck '%s' ora passa per %s su %s

source: annocheck '%s' test now fails for %s on %s
es: annocheck '%s' prueba ahora falla para %s sobre %s
it: test annocheck '%s' ora fallisce per %s su %s

source: annocheck '%s' test fails for %s on %s
es: annocheck '%s' prueba falla para %s sobre %s
it: test annocheck '%s' fallisce per %s su %s

source: %s may have lost -D_FORTIFY_SOURCE on %s
es: %s puede haber perdido -D_FORTIFY_SOURCE sobre %s
it: %s potrebbe aver perso -D_FORTIFY_SOURCE su %s

source: lost ${ARCH}
es: pierde ${ARCH}
it: perso ${ARCH}

source: Architecture '%s' has disappeared
es: Arquitectura '%s' ha desaparecido
it: L'architettura '%s' è scomparsa

source: gained ${ARCH}
es: ganaba ${ARCH}
it: ottenuto ${ARCH}

source: Architecture '%s' has appeared
es: Arquitectura '%s' ha aparecido
it: L'architettura '%s' è apparsa

source: Forbidden function symbols found:
es: Símbolos de función prohibida encontrado:
it: Simboli di funzione proibiti trovati:

source: %s may use forbidden functions on %s
es: %s puede utilizar funciones prohibida sobre %s
it: %s potrebbe usare funzioni proibite su %s

source: forbidden functions in ${FILE} on ${ARCH}
es: funciones prohibidas en ${FILE} sobre ${ARCH}
it: funzioni proibite in ${FILE} su ${ARCH}

source: File capabilities for %s changed from '%s' to '%s' in %s on %s
es: Capacidades de archivo para %s cambiada desde '%s' a '%s' en %s sobre %s
it: Capabilities del file %s cambiate da '%s' a '%s' in %s su %s

source: ${FILE} capabilities on ${ARCH}
es: ${FILE} de capacidades sobre ${ARCH}
it: capabilities di ${FILE} su ${ARCH}

source: File capabilities found for %s: '%s' in %s on %s
es: Capacidades de archivo encontrado para %s: '%s' en %s sobre %s
it: Capabilities del file trovate per %s: '%s' in %s su %s

source: File capabilities list entry found for %s: '%s' in %s on %s, matches package
es: Encontrado apunte de listado de capacidades del archivo para %s: '%s' dentro de %s sobre %s, coincide con paquete
it: Voce nell'elenco capabilities del file trovata per %s: '%s' in %s su %s, corrisponde al pacchetto

source: File capabilities list mismatch for %s: expected '%s', got '%s' in %s on %s
it: Mancata corrispondenza nell'elenco capabilities del file per %s: previsto '%s', ottenuto '%s' in %s su %s

source: ${FILE} capabilities list on ${ARCH}
it: elenco capabilities di ${FILE} su ${ARCH}

source: File capabilities for %s (%s) not found on the capabilities list in %s on %s
es: Capacidades se archivo para %s (%s) no encontrado en el listado de capacidades en %s sobre %s
it: Capabilities del file per %s (%s) non trovate nell'elenco capabilities in %s su %s

source: File capabilities expected for %s in %s but not found on %s: expected '%s'
it: Capabilities del file previste per %s in %s ma non trovate su %s: previsto '%s'

source: Changes to security policy related files require inspection by the Security Response Team.
it: Le modifiche ai file relativi alla politica di sicurezza richiedono l'ispezione da parte del Team di Risposta alla Sicurezza.

source: Compressed %s file %s changed content in %s on %s.
it: Il contenuto del file compresso %s %s è cambiato in %s su %s.

source: Error running msgunfmt on %s in %s on %s; malformed mo file?
it: Errore nell'esecuzione di msgunfmt su %s in %s su %s; file mo malformato?

source: msgunfmt on ${FILE}
it: msgunfmt su ${FILE}

source: Message catalog %s changed content in %s on %s
it: Il contenuto del catalogo messaggi %s è cambiato in %s su %s

source: Public header file %s changed content in %s on %s. A unified diff of the changes follows.
it: Il contenuto del file di intestazione pubblico %s è cambiato in %s su %s. Segue un diff unificato delle modifiche.

source: File %s changed content in %s on %s.
it: Il contenuto del file %s è cambiato in %s su %s.

source: Inspection skipped because this build's type is not `rpm'.
it: Ispezione saltata perché il tipo di questa build non è `rpm'.

source: %%config file %s went from actual file to symlink (pointing to %s) in %s on %s
it: Il file %%config %s è passato da file effettivo a collegamento simbolico (che punta a %s) in %s su %s

source: %%config file %s was a symlink (pointing to %s), became an actual file in %s on %s
it: Il file %%config %s era un collegamento simbolico (che puntava a %s), è diventato un file effettivo in %s su %s

source: Symlink value for %%config file %s changed in %s on %s.
it: Valore del collegamento simbolico per il file %%config %s cambiato in %s su %s.

source: %%config file content change for %s in %s on %s
it: Modifica del contenuto del file %%config per %s in %s su %s

source: %%config file change for %s in %s on %s (%smarked as %%config -> %smarked as %%config)
it: Modifica del file %%config per %s in %s su %s (%scontrassegnato come %%config -> %scontrassegnato come %%config)

source: not
es: no
it: non

source: %s in %s on %s is missing debugging symbols
it: %s in %s su %s manca dei simboli di debug

source: missing debugging symbols
es: faltando símbolos depurantes
it: simboli di debug mancanti

source: Missing: %s
es: Ausente: %s
it: Mancante: %s

source: %s in %s on %s contains debugging symbols
es: %s dentro de %s en %s contiene símbolos depurantes
it: %s in %s su %s contiene simboli di debug

source: contains debugging symbols
es: contiene símbolos depurantes
it: contiene simboli di debug

source: Contains: %s
es: Contiene: %s
it: Contiene: %s

source: %s in %s on %s gained debugging symbols
es: %s interno a %s sobre %s ganó símbolos depurantes
it: %s in %s su %s ha acquisito simboli di debug

source: gained debugging symbols
es: ganó símbolos depurantes
it: acquisito simboli di debug

source: Gained: %s
es: Ganado: %s
it: Acquisito: %s

source: %s in %s on %s lost debugging symbols
es: %s interno a %s sobre %s pierde símbolos de depuración
it: %s in %s su %s ha perso simboli di debug

source: lost debugging symbols
es: pierde símbolos depurantes
it: perso simboli di debug

source: Lost: %s
es: Pierde: %s
it: Perso: %s

source: %s in %s on %s carries .gosymtab but should not have the .gnu_debugdata symbol
es: %s interno a %s sobre %s lleva .gosymtab pero tendría el símbolo .gnu_debugdata
it: %s in %s su %s contiene .gosymtab ma non dovrebbe avere il simbolo .gnu_debugdata

source: .gnu_debugdata with .gosymtab
es: .gnu_debugdata con .gosymtab
it: .gnu_debugdata con .gosymtab

source: Desktop file %s on %s references executable %s but %s is not executable by all
es: Archivo %s de escritorio en %s referencia ejecutable %s pero %s no es ejecutable para todos
it: Il file desktop %s su %s fa riferimento all'eseguibile %s ma %s non è eseguibile da tutti

source: ${FILE} references non-executable file on ${ARCH}
es: ${FILE} referencia archivo no-ejecutable sobre ${ARCH}
it: ${FILE} fa riferimento a un file non eseguibile su ${ARCH}

source: Desktop file %s on %s references executable %s; no subpackages contain an executable of that name, however it has a TryExec key so it may be ignored in case %s does not exist
es: Archivo %s de escritorio sobre %s referencia ejecutable %s; no subpaquetes contienen un ejecutable de ese nombre, sin embargo tiene una clave TryExec tal que puede ser ignorado en caso de %s no existe
it: Il file desktop %s su %s fa riferimento all'eseguibile %s; nessun sotto-pacchetto contiene un eseguibile con quel nome, tuttavia ha una chiave TryExec quindi può essere ignorato nel caso %s non esista

source: Desktop file %s on %s references executable %s but no subpackages contain an executable of that name
es: Archivo %s de escritorio en %s se referencia ejecutable %s pero no subpaquetes contiene un ejecutable de ese nombre
it: Il file desktop %s su %s fa riferimento all'eseguibile %s ma nessun sotto-pacchetto contiene un eseguibile con quel nome

source: ${FILE} references missing executable on ${ARCH}
es: ${FILE} le falta referencias ejecutables sobre ${ARCH}
it: ${FILE} fa riferimento a un eseguibile mancante su ${ARCH}

source: Desktop file %s on %s references icon %s but %s is not readable by all
es: Archivo %s de escritorio sobre %s referencia icono %s pero %s no es legible por todos
it: Il file desktop %s su %s fa riferimento all'icona %s ma %s non è leggibile da tutti

source: ${FILE} references unreadble icon on ${ARCH}
es: ${FILE} referencias de icono no legible sobre ${ARCH}
it: ${FILE} fa riferimento a un'icona illeggibile su ${ARCH}

source: Desktop file %s on %s references icon %s but no subpackages contain %s
es: Archivo %s de escritorio sobre %s referencia icono %s pero ningún subpaquete contiene %s
it: Il file desktop %s su %s fa riferimento all'icona %s ma nessun sotto-pacchetto contiene %s

source: ${FILE} references missing icon on ${ARCH}
es: ${FILE} le falta referencias de icono en ${ARCH}
it: ${FILE} fa riferimento a un'icona mancante su ${ARCH}

source: ${FILE} is not valid on ${ARCH}
es: ${FILE} no es válido sobre ${ARCH}
it: ${FILE} non è valido su ${ARCH}

source: File %s is no longer a valid desktop entry file on %s; desktop-file-validate reports:
es: El archivo %s no es más largo que un archivo de apunte de escroto válido en %s; desktop-file-validate informa:
it: Il file %s non è più un file di voce desktop valido su %s; desktop-file-validate riporta:

source: New file %s is not a valid desktop file on %s; desktop-file-validate reports:
es: Archivo nuevo %s no es un archivo de escritorio válido en %s; desktop-file-validate informa:
it: Il nuovo file %s non è un file desktop valido su %s; desktop-file-validate riporta:

source: File %s is not a valid desktop file on %s; desktop-file-validate reports:
es: Archivo %s no es un archivo de escritorio válido en %s; desktop-file-validate informa:
it: Il file %s non è un file desktop valido su %s; desktop-file-validate riporta:

source: The %s file is missing the %s tag.
es: Al archivo %s le falta la etiqueta %s.
it: Il file %s manca del tag %s.

source: ${FILE} missing Release tag
es: ${FILE} le falta etiqueta Release
it: ${FILE} manca il tag Release

source: The %s tag value is missing the dist tag in the proper form. The dist tag should be of the form '%s' in the %s tag or in a macro used in the %s tag. After RPM macro expansion, no dist tag was found in this %s tag value.
it: Il valore del tag %s manca del tag dist nella forma corretta. Il tag dist dovrebbe essere della forma '%s' nel tag %s o in una macro usata nel tag %s. Dopo l'espansione della macro RPM, nessun tag dist è stato trovato in questo valore del tag %s.

source: ${FILE} does not use '%%{?dist}' in Release
it: ${FILE} non usa '%%{?dist}' in Release

source: Specified package is not a source RPM, skipping.
es: Paquete específico no es una fuente RPM, se descarta.
it: Il pacchetto specificato non è un RPM sorgente, salto.

source: %%doc file content change for %s in %s on %s
es: %%doc de contenido de archivo cambia para %s en %s sobre %s
it: Modifica del contenuto del file %%doc per %s in %s su %s

source: %%doc file change for %s in %s on %s (%smarked as %%doc -> %smarked as %%doc)
es: Archivo %%doc cambia para %s en %s sobre %s (%s marcado como %%doc → %smarked como %%doc)
it: Modifica del file %%doc per %s in %s su %s (%scontrassegnato come %%doc -> %scontrassegnato come %%doc)

source: %s was an ELF file and now is not on %s
es: %s era un archivo ELF y ahora no está en %s
it: %s era un file ELF e ora non lo è più su %s

source: ELF file ${FILE} on ${ARCH}
es: Archivo ELF ${FILE} en ${ARCH}
it: File ELF ${FILE} su ${ARCH}

source: %s was a dynamic ELF file and now is not on %s
es: %s fue un archivo ELF dinámico y ahora no está en %s
it: %s era un file ELF dinamico e ora non lo è più su %s

source: DT_NEEDED symbol(s) removed from %s on %s
es: Símbolo(s) DT_NEEDED retirados desde %s sobre %s
it: Simbolo/i DT_NEEDED rimosso/i da %s su %s

source: DT_NEEDED symbol(s) in ${FILE} on ${ARCH}
es: Símbolo(s) DT_NEEDED en ${FILE} en ${ARCH}
it: Simbolo/i DT_NEEDED in ${FILE} su ${ARCH}

source: DT_NEEDED symbol(s) added to %s on %s
es: Símbolo(s) DT_NEEDED añadidos a %s en %s
it: Simbolo/i DT_NEEDED aggiunto/i a %s su %s

source: Object still has executable stack (no GNU-stack note): %s on %s
es: Objeto aún tiene pila ejecutable (nota no pila GNU): %s sobre %s
it: L'oggetto ha ancora stack eseguibile (nessuna nota GNU-stack): %s su %s
