Repository: rpminspect/rpminspect-l10n
Catalog: *.po
Languages: es, it

source: Ensure packages contain an entry in the %changelog for the version built. Reports any other differences in the existing changelog between builds and that the new entry contains new text entries.
es: Asegura paquetes conteniendo un apunte en el %changelog para la versión de compilación. Informa cualquier otra diferencia dentro del changelog existente entre compilaciones y que el apunte nuevo contiene apuntes de texto nuevos.
it: Assicurati che i pacchetti contengano una voce nel %changelog per la versione creata. Segnala qualsiasi altra differenza nel registro delle modifiche esistente tra le build e che la nuova voce contiene nuove voci di testo.

source: Report files that are packaged in directories that are no longer used by the product. Usually this means a package has not been updated to account for path migrations. The main examples are /bin migrating to /usr/bin and /sbin migrating to /usr/sbin.
es: Los archivos del informe que están empaquetados en directorios que no son más largos utilizado por el producto. Usualmente esto significa que un paquete no ha sido actualizado para contar a migraciones de ruta. Los ejemplos principales son /bin migrando a /usr/bin y /sbin migrando a /usr/sbin.
it: Segnalare i file compressi in directory che non vengono più utilizzate dal prodotto. Di solito ciò significa che un pacchetto non è stato aggiornato per tenere conto delle migrazioni dei percorsi. Gli esempi principali sono la migrazione di /bin a /usr/bin e la migrazione di /sbin a /usr/sbin.

source: Link Time Optimization (LTO) produces smaller and faster shared ELF executables and libraries. LTO bytecode is not stable from one release of gcc to the next. As such, LTO bytecode should not be present in .a and .o ELF objects shipped in packages. This inspection looks for LTO bytecode in ELF relocatable objects and reports if any is present.
es: Optimización de Tiempo del Enlace (LTO) produce ejecutables y bibliotecas ELF compartidos más pequeños y más rápidos. Los bytecode LTO no son estables desde una publicación de gcc a la siguiente. Como tal, el bytecode LTO no estaría presente dentro de uno de los objetos .a y .o ELF embarcado en paquetes. Esta inspección busca bytecode LTO en objetos ELF reubicables e informes si cualquier está presente.
it: Link Time Optimization (LTO) produce eseguibili e librerie ELF condivisi più piccoli e più veloci. Il bytecode LTO non è stabile da una versione di gcc a quella successiva. Pertanto, il bytecode LTO non dovrebbe essere presente negli oggetti ELF .ae .o spediti nei pacchetti. Questa ispezione cerca il bytecode LTO negli oggetti rilocabili ELF e segnala se ne è presente.

source: Symbolic links must be resolvable on the installed system. This inspection ensures absolute and relative symlinks are valid. It also checks for any symlink usage that will cause problems for RPM.
es: Enlaces simbólicos deben ser resolubles en el sistema instalado. Esta inspección asegura enlaces simbólicos absolutos y relativos sean válidos. Además comprueba para cualquier empleo de enlace simbólico que causará problemas para RPM.
it: I collegamenti simbolici devono essere risolvibili sul sistema installato. Questa ispezione garantisce che i collegamenti simbolici assoluti e relativi siano validi. Controlla inoltre l'eventuale utilizzo di collegamenti simbolici che potrebbe causare problemi a RPM.

source: Check %files sections in the spec file for any forbidden path references.
es: Comprueba secciones de %files dentro del archivo específico para cualquiera de las referencias de ruta prohibida.
it: Controlla le sezioni %files nel file delle specifiche per eventuali riferimenti a percorsi vietati.

source: Compare MIME types of files between builds and report any changes for verification.
es: Compara tipos MIME de archivos entre compilaciones e informa cualquier cambio para verificación.
it: Confronta i tipi di file MIME tra le build e segnala eventuali modifiche per la verifica.

source: When comparing two builds or two packages, compare ELF files using abidiff(1) from the libabigail project. Differences are reported. If the package is a rebase and not on the rebaseable list and the rebase inspection is enabled, ABI differences are reported as failures. The assumption here is that rpminspect is comparing builds for maintenance purposes and you do not want to introduce any ABI changes for users. If you do not care about that, turn off the abidiff inspection or add the package name to the rebaseable list.
es: Cuando compara dos compilaciones o dos paquetes, compara archivos ELF utilizando abidiff(1) desde el proyecto libabigail. Las diferencias son informadas. Si el paquete es un rebase y no dentro del listado rebaseable y la inspección rebase está habilitada, las diferencias ABI son informadas como fallos. La asunción aquí es que rpminspect está comparando compilaciones para propósitos de mantenimiento y no quiere introducir cualquier cambio de ABI para usuarios. Si no toma en cuenta sobre eso, apague la inspección abidiff o añada el nombre de paquete para el listado rebaseable.
it: Quando confronti due build o due pacchetti, confronta i file ELF usando abidiff(1) dal progetto libabigail. Vengono riportate le differenze. Se il pacchetto è un rebase e non è presente nell'elenco rebaseable e l'ispezione rebase è abilitata, le differenze ABI vengono segnalate come errori. Il presupposto qui è che rpminspect stia confrontando le build a scopo di manutenzione e che non si desideri introdurre alcuna modifica ABI per gli utenti. Se non ti interessa, disattiva l'ispezione abidiff o aggiungi il nome del pacchetto all'elenco riutilizzabile.

source: kmidiff compares the binary Kernel Module Interfaces of two Linux kernel trees. The binary KMI is the interface that the Linux kernel exposes to its modules. The trees we are interested in here are the result of the build of the Linux kernel source tree. If the builds compared are not considered a rebase, an incompatible change reported by kmidiff is reported for verification.
es: kmidiff compara los Kernel Module Interfaces binarios de dos árboles del kernel Linux. El KMI binario es el interfaz que el kernel Linux expone a sus módulos. Los árboles estamos que estamos interesados aquí son el resultado de la compilación del árbol de la fuente del kernel Linux. Si las compilaciones comparadas no son consideradas una rebase, para verificación se informa por kmidiff un cambio incompatible.
it: kmidiff confronta le interfacce binarie del modulo kernel di due alberi del kernel Linux. Il KMI binario è l'interfaccia che il kernel Linux espone ai suoi moduli. Gli alberi a cui siamo interessati qui sono il risultato della creazione dell'albero dei sorgenti del kernel Linux. Se le build confrontate non sono considerate un rebase, una modifica incompatibile segnalata da kmidiff viene segnalata per la verifica.

source: Check for and report differences in configuration files marked with %config in the spec file. If changes are whitespace or formatting only, the result is reported at the INFO level. Content and location changes are reporting at the VERIFY level unless the comparison is between rebased packages.
es: Comprueba e informa diferencias en archivos de configuración marcados con %config en el archivo spec. Si solo los cambios son espacios en blanco o formato, el resultado es informado en el nivel de INFO. Los cambios del contenido y ubicación son informados en el nivel VERIFY a no ser que la comparación es entre paquetes rebasados.
it: Controlla e segnala le differenze nei file di configurazione contrassegnati con %config nel file spec. Se le modifiche riguardano solo spazi bianchi o formattazione, il risultato viene riportato a livello INFO. Le modifiche al contenuto e alla posizione vengono segnalate a livello VERIFY a meno che il confronto non avvenga tra pacchetti ribasati.

source: Report changes in %doc marked files. Files that have been added or removed as documentation files, for instance.
es: Los cambios del informe en %doc carcó archivos. Los archivos que han sido añadidos o quitados como archivos de documentación, para instancia.
it: Segnala modifiche nei file contrassegnati con %doc. File che sono stati aggiunti o rimossi come file di documentazione, ad esempio.

source: Inspects all patches defined in the spec file and reports changes between builds. The functional check here is to ensure all defined patches in the preamble have a corresponding application macro in the spec file. At the INFO level, rpminspect reports file count, line count, and patch size changes. If thresholds are reached regarding a change in the patch size or the number of files the patch touches, rpminspect reports the change at the VERIFY level unless the comparison is for a rebase. The configuration file can also list patch names that rpminspect should ignore during the inspection.
es: Inspecciona todos los parches definidos en el archivo de especificaciones e informa los cambios entre compilaciones. La comprobación funcional consiste en garantizar que todos los parches definidos en el preámbulo tengan una macro de aplicación correspondiente en el archivo de especificaciones. En el nivel INFO, rpminspect informa sobre el número de archivos, el número de líneas y los cambios en el tamaño del parche. Si se alcanzan los umbrales de cambio en el tamaño del parche o en el número de archivos que el parche afecta, rpminspect informa el cambio en el nivel VERIFY, a menos que la comparación se deba a una reorganización. El archivo de configuración también puede indicar los nombres de los parches que rpminspect debe ignorar durante la inspección.
it: Esamina tutte le patch definite nel file delle specifiche e segnala le modifiche tra le build. Il controllo funzionale qui è quello di garantire che tutte le patch definite nel preambolo abbiano una macro applicativa corrispondente nel file delle specifiche. A livello INFO, rpminspect riporta il conteggio dei file, il conteggio delle righe e le modifiche alle dimensioni delle patch. Se vengono raggiunte le soglie relative a una modifica nella dimensione della patch o nel numero di file toccati dalla patch, rpminspect segnala la modifica al livello VERIFY a meno che il confronto non sia per un rebase. Il file di configurazione può anche elencare i nomi delle patch che rpminspect dovrebbe ignorare durante l'ispezione.

source: Performs a virus scan on every file in the build using libclamav. Anything found by libclamav will fail the inspection. The ignore_path rules are not used in this inspection. All files are scanned.
es: Actúa un análisis de virus en cada archivo en la complexión que utiliza libclamav. Cualquier cosa encontrado por libclamav fallará la inspección. Las reglas ignore_path no son utilizadas en esta inspección. Todos las archivos son analizados.
it: Esegue una scansione antivirus su ogni file nella build utilizzando libclamav. Qualunque cosa trovata da libclamav non supererà l'ispezione. Le regole ignore_path non vengono utilizzate in questa ispezione. Tutti i file vengono scansionati.

source: Check for known politically sensitive files in packages and report if they are allowed or prohibited. The rules come from the politics/ subdirectory in the rpminspect-data package for the product. Files in politics/ subdirectory map to the product release string. The rules in each file define the politically sensitive allow and deny rules for that release.
es: Compruebe si hay archivos políticamente sensibles en los paquetes e informe si están permitidos o prohibidos. Las reglas provienen del subdirectorio politics/ del paquete rpminspect-data del producto. Los archivos del subdirectorio politics/ se asignan a la cadena de versión del producto. Las reglas de cada archivo definen las reglas de permiso y denegación políticamente sensibles para esa versión.
it: Verificare la presenza di file politicamente sensibili noti nei pacchetti e segnalare se sono consentiti o vietati. Le regole provengono dalla sottodirectory politics/ nel pacchetto rpminspect-data per il prodotto. I file nella sottodirectory politics/ vengono mappati alla stringa di rilascio del prodotto. Le regole in ogni file definiscono le regole di autorizzazione e negazione politicamente sensibili per quella versione.

source: Check for forbidden functions in ELF files. Forbidden functions are defined in the runtime configuration files. Usually this inspection is used to catch built packages that make use of deprecated API functions if you wish built packages to conform to replacement APIs.
es: Comprueba si hay funciones prohibidas en los archivos ELF. Estas funciones se definen en los archivos de configuración del entorno de ejecución. Normalmente, esta inspección se utiliza para detectar paquetes compilados que utilizan funciones de API obsoletas si se desea que los paquetes compilados se ajusten a las API de reemplazo.
it: Verifica la presenza di funzioni vietate nei file ELF. Le funzioni vietate sono definite nei file di configurazione runtime. Di solito questa ispezione viene utilizzata per individuare i pacchetti compilati che fanno uso di funzioni API deprecate se si desidera che i pacchetti compilati siano conformi alle API sostitutive.

source: Check for forbidden paths in both the DT_RPATH and DT_RUNPATH settings in ELF shared objects.
es: Verifique las rutas prohibidas en las configuraciones DT_RPATH y DT_RUNPATH en los objetos compartidos ELF.
it: Controlla i percorsi vietati nelle impostazioni DT_RPATH e DT_RUNPATH negli oggetti condivisi ELF.

source: Scan extracted and patched source code files, scripts, and RPM spec files for any prohibited Unicode code points, as defined in the configuration file. Any prohibited code points are reported as a possible security risk.
es: Analice los archivos de código fuente extraídos y parcheados, los guiones y los archivos de especificaciones RPM en busca de puntos de código Unicode prohibidos, según lo definido en el archivo de configuración. Cualquier punto de código prohibido se reporta como un posible riesgo de seguridad.
it: Esegui la scansione dei file di codice sorgente, degli script e dei file delle specifiche RPM estratti e corretti per individuare eventuali punti di codice Unicode vietati, come definito nel file di configurazione. Eventuali punti di codice vietati vengono segnalati come possibile rischio per la sicurezza.

source: Check for correct RPM dependency metadata. Report incorrect or conflicting findings as well as expected changes when comparing a new build to an older build. Changes are only reported when comparing builds, but this inspection will check for correct RPM dependency metadata when inspecting a single build and report findings.
es: Verifique que los metadatos de dependencia de RPM sean correctos. Reporte hallazgos incorrectos o contradictorios, así como los cambios esperados, al comparar una compilación nueva con una anterior. Los cambios solo se reportan al comparar compilaciones, pero esta inspección verificará que los metadatos de dependencia de RPM sean correctos al inspeccionar una sola compilación e informará los hallazgos.
it: Verificare la presenza di metadati di dipendenza RPM corretti. Segnala risultati errati o contrastanti nonché modifiche previste quando confronti una nuova build con una build precedente. Le modifiche vengono segnalate solo quando si confrontano le build, ma questa ispezione controllerà i metadati corretti delle dipendenze RPM durante l'ispezione di una singola build e riporterà i risultati.

source: Checks that files in RPM packages have their debugging symbols stripped and files in debuginfo packages carry debugging symbols. When comparing builds, report where symbols unexpectedly appear or disappear and what corrective action is needed.
es: Comprueba que los archivos de los paquetes RPM tengan sus símbolos de depuración eliminados y que los archivos de los paquetes debuginfo contengan símbolos de depuración. Al comparar compilaciones, informa dónde aparecen o desaparecen símbolos inesperadamente y qué medidas correctivas son necesarias.
it: Controlla che i file nei pacchetti RPM abbiano i simboli di debug rimossi e che i file nei pacchetti debuginfo contengano simboli di debug. Quando si confrontano le build, segnalare dove i simboli appaiono o scompaiono inaspettatamente e quale azione correttiva è necessaria.

source: Perform syntax check on udev rules files using udevadm verify.
es: Realice una verificación de sintaxis en los archivos de reglas de udev usando udevadm verify.
it: Eseguire il controllo della sintassi sui file delle regole udev utilizzando udevadm verify.

source: Change the string specified on the 'Vendor:' line in the spec file.
es: Cambie la cadena especificada en la línea 'Vendor:' en el archivo de especificaciones.
it: Modificare la stringa specificata nella riga "Vendor:" nel file delle specifiche.

source: Make sure the SRPM is built on a host within the expected subdomain.
es: Asegúrese de que el SRPM esté construido en un host dentro del subdominio esperado.
it: Assicurati che l'SRPM sia costruito su un host all'interno del sottodominio previsto.

source: Unprofessional language as defined in the configuration file was found in the text shown. Remove or change the offending words and rebuild.
es: Se ha encontrado un idioma inapropiado, según lo definido en el archivo de configuración, en el texto mostrado. Elimine o modifique las palabras ofensivas y reconstruya el sistema.
it: Nel testo mostrato è stato trovato un linguaggio non professionale come definito nel file di configurazione. Rimuovi o modifica le parole offensive e ricostruisci.

source: Check to see if you eliminated a subpackage but still have the %package and/or the %files section for it.
es: Verifique si eliminó un subpaquete pero aún tiene la sección %package y/o sección %files para ello.
it: Controlla se hai eliminato un sottopacchetto ma hai ancora il relativo %pacchetto e/o la sezione %files.

source: The License tag must contain an approved license string as defined by the distribution (e.g., GPLv2+). If the license in question is approved, the license database needs updating in the rpminspect-data package.
es: La etiqueta License debe contener una cadena de licencia aprobada como definió por la distribución (p.ej., GPLv2+). Si está aprobada la licencia en cuestión, la base de datos de licencia necesita actualizarse en el paquete rpminspect-data.
it: Il tag di License deve contenere una stringa di licenza approvata come definita dalla distribuzione (ad esempio, GPLv2+). Se la licenza in questione viene approvata, il database delle licenze deve essere aggiornato nel pacchetto rpminspect-data.

source: Make sure the licensedb setting in the rpminspect configuration is set to a valid licensedb file. This is also commonly due to a missing vendor specific rpminspect-data package on the system.
es: Asegure que la especificación de licensedb dentro de la configuración rpminspect está puesta para un archivo licensedb válido. Esto además es comúnmente debido a una especificación de proveedor ausente en el paquete rpminspect-data del sistema.
it: Assicurati che l'impostazione Licensedb nella configurazione di rpminspect sia impostata su un file licensedb valido. Ciò è comunemente dovuto anche alla mancanza del pacchetto rpminspect-data specifico del fornitore nel sistema.

source: The specified license abbreviation is not listed as approved in the license database. The license database is specified in the rpminspect configuration file. Check this file and send a pull request to the appropriate upstream project to update the database. If the license is listed in the database but marked unapproved, you may need to work with the legal team regarding options for this software.
es: La abreviatura de licencia especificada no figura como aprobada en la base de datos de licencias. La base de datos de licencias se especifica en el archivo de configuración rpminspect. Revise este archivo y envíe una solicitud de extracción al proyecto original correspondiente para actualizar la base de datos. Si la licencia aparece en la base de datos, pero está marcada como no aprobada, es posible que deba consultar con el equipo legal sobre las opciones disponibles para este software.
it: L'abbreviazione della licenza specificata non è elencata come approvata nel database delle licenze. Il database delle licenze è specificato nel file di configurazione rpminspect. Controlla questo file e invia una richiesta pull al progetto upstream appropriato per aggiornare il database. Se la licenza è elencata nel database ma contrassegnata come non approvata, potrebbe essere necessario collaborare con il team legale per quanto riguarda le opzioni per questo software.

source: Ensure all object files are compiled with -fPIC
es: Asegure todos los archivos objeto estén compilados con -fPIC
it: Assicurati che tutti i file oggetto siano compilati con -fPIC

source: Ensure that the package is being built with the correct compiler and compiler flags
es: Asegure que el paquete esté siendo compilado con el compilador correcto y los indicadores del compilador
it: Assicurarsi che il pacchetto venga creato con il compilatore e i flag del compilatore corretti

source: The data in an ELF file appears to be corrupt; ensure that packaged ELF files are not being truncated or incorrectly modified
es: Los datos dentro del un archivo ELF parece estar corrupto; asegure que los archivos ELF empaquetados no están siendo truncados o modificados incorrectamente
it: I dati in un file ELF sembrano corrotti; assicurarsi che i file ELF compressi non vengano troncati o modificati in modo errato

source: An ELF stack is marked as executable. Ensure that no execstack options are being passed to the linker, and that no functions are defined on the stack.
es: Una pula ELF está marcada como ejecutable. Asegúrese que ninguna de las opciones de execstack está siendo pasada para el enlazador, y que ninguna de las funciones están definidas en la pila.
it: Uno stack ELF è contrassegnato come eseguibile. Assicurarsi che nessuna opzione execstack venga passata al linker e che nessuna funzione sia definita nello stack.

source: Ensure executables are linked with with '-z relro -z now'
es: Asegure ejecutables estén enlazados con '-z relro -z now'
it: Assicurati che gli eseguibili siano collegati con '-z relro -z now'

source: Correct the errors in the man page as reported by the libmandoc parser.
es: Corrija los errores dentro de la página man como informó por el intérprete libmandoc.
it: Correggere gli errori nella pagina man come riportato dal parser libmandoc.

source: Correct the installation path for the man page. Man pages must be installed in the directory beneath /usr/share/man that matches the section number of the page.
es: Corrija la ruta de instalación para la página man. Las páginas man deben estar instalados dentro del directorio entre /usr/share/man que coincida con el número de la sección de la página.
it: Correggere il percorso di installazione per la pagina man. Le pagine man devono essere installate nella directory sotto /usr/share/man che corrisponde al numero di sezione della pagina.

source: Correct the reported errors in the XML document
es: Corrige los errores informados en el documento XML
it: Correggere gli errori segnalati nel documento XML

source: Refer to the Desktop Entry Specification at https://standards.freedesktop.org/desktop-entry-spec/latest/ for help correcting the errors and warnings
es: Refiera a la Especificación de Apunte de Escritorio en https://standards.freedesktop.org/desktop-entry-spec/latest/ para ayuda corrigiendo los errores y advertencias
it: Fare riferimento alla specifica Desktop Entry su https://standards.freedesktop.org/desktop-entry-spec/latest/ per assistenza nella correzione di errori e avvisi
