Repository: rpminspect/rpminspect-l10n
Catalog: *.po
Languages: es, it

source: ELF .o and .a files should not carry LTO (Link Time Optimization) bytecode. Make sure you have stripped LTO bytecode from those files at install time.
es: Los archivos ELF .o y .a no deben acarrear código de bytes LTO (Optimización del Tiempo de Enlace). Asegúrese de haber descubierto el código de bytes LTO de estos archivos durante la instalación.
it: I file ELF .o e .a non dovrebbero contenere bytecode LTO (Link Time Optimization). Assicurarsi di aver rimosso il bytecode LTO da quei file al momento dell'installazione.

source: Make sure symlinks point to a valid destination in one of the subpackages of the build; dangling symlinks are not allowed. If you are comparing builds and have a non-symlink turn in to a symlink, ensure this is deliberate. NOTE: You cannot turn a directory in to a symlink due to RPM limitations.
es: Asegure que el punto de los enlaces simbólicos a un destino válido dentro de uno de los subpaquetes de la compilación; bailando enlaces simbólicos no está permitido. Si está comparando compilaciones y tiene un enlace no simbólico dentro para un enlace simbólico, asegure esto esté deliberado. NOTA: No se puede volver a un directorio dentro para un enlace simbólico debido a limitaciones de RPM.
it: Assicurarsi che i collegamenti simbolici puntino a una destinazione valida in uno dei sotto-pacchetti della build; i collegamenti simbolici interrotti non sono consentiti. Se si stanno confrontando build e un file non simbolico si trasforma in un collegamento simbolico, assicurarsi che ciò sia intenzionale. NOTA: non è possibile trasformare una directory in un collegamento simbolico a causa delle limitazioni di RPM.

source: Make sure symlinks point to a valid destination in one of the subpackages of the build; dangling symlinks are not allowed. If you are comparing builds and have a non-symlink turn in to a symlink, ensure this is deliberate. NOTE: You cannot turn a directory in to a symlink due to RPM limitations. If you absolutely must do that, make sure you include the %pretrans scriptlet for replacing a directory. See the packaging guidelines for 'Scriptlet to replace a directory' for more information.
it: Assicurarsi che i collegamenti simbolici puntino a una destinazione valida in uno dei sotto-pacchetti della build; i collegamenti simbolici interrotti non sono consentiti. Se si stanno confrontando build e un file non simbolico si trasforma in un collegamento simbolico, assicurarsi che ciò sia intenzionale. NOTA: non è possibile trasformare una directory in un collegamento simbolico a causa delle limitazioni di RPM. Se è assolutamente necessario farlo, assicurarsi di includere lo scriptlet %pretrans per sostituire una directory. Vedere le linee guida per l'impacchettamento per 'Scriptlet per sostituire una directory' per maggiori informazioni.

source: Remove forbidden path references from the indicated line in the %files section. In many cases you can use RPM macros to specify path locations. See the RPM documentation or distribution package maintainer guide for more information.
it: Rimuovere i riferimenti a percorsi proibiti dalla riga indicata nella sezione %files. In molti casi è possibile utilizzare le macro RPM per specificare le posizioni dei percorsi. Vedere la documentazione RPM o la guida per i manutentori dei pacchetti di distribuzione per maggiori informazioni.

source: In many cases the changing MIME type is deliberate. Verify that the change is intended and if necessary fix the spec file so the correct file is included in the built package.
es: En muchos casos el tipo MIME cambiado está deliberado. Verifique que el cambio es intencionado y si necesario repara el archivo spec tal que el archivo correcto esté incluido dentro del paquete construido.
it: In molti casi la modifica del tipo MIME è intenzionale. Verificare che la modifica sia voluta e, se necessario, correggere il file spec in modo che il file corretto sia incluso nel pacchetto compilato.

source: ABI changes introduced during maintenance updates can lead to problems for users. See the abidiff(1) documentation and the distribution ABI policies to determine if this detected change is allowed.
es: Cambios ABI introducido durante actualizaciones de mantenimiento puede dirigir a problemas para usuarios. Consulte la documentación de abidiff(1) y las normativas ABI de distribución para determinar si este cambio detectado está permitido.
it: Modifiche ABI introdotte durante gli aggiornamenti di manutenzione possono causare problemi agli utenti. Vedere la documentazione di abidiff(1) e le politiche ABI della distribuzione per determinare se questa modifica rilevata è consentita.

source: Kernel Module Interface introduced during maintenance updates can lead to problems for users. See the libabigail documentation and the distribution KMI policy to determine if this detected change is allowed.
es: El Interfaz de Módulo del Kernel introducido durante actualizaciones de mantenimiento pueden llevar a problemas para usuarios. Consulte la documentación libabigail y la normativa de distribución KMI para determinar si este cambio detectado está permitido.
it: L'interfaccia del modulo del kernel introdotta durante gli aggiornamenti di manutenzione può causare problemi agli utenti. Vedere la documentazione di libabigail e la politica KMI della distribuzione per determinare se questa modifica rilevata è consentita.

source: Changes to %config should be done carefully. Make sure you have installed the correct file and in the correct location. If a package is restructuring configuration files, make sure the package can handle upgrading an existing package -or- honor the old file locations.
es: Cambia a %config sería hecho cuidadosamente. Asegure que tenga instalado el archivo correcto y dentro del lugar correcto. Si un paquete está estructurando archivos de configuración, asegúrese que el paquete puede manipular modernizar un paquete existente -o- honrar los lugares del archivo antiguo.
it: Le modifiche a %config dovrebbero essere fatte con attenzione. Assicurarsi di aver installato il file corretto nella posizione corretta. Se un pacchetto sta ristrutturando i file di configurazione, assicurarsi che il pacchetto possa gestire l'aggiornamento di un pacchetto esistente -oppure- rispettare le vecchie posizioni dei file.

source: Changes found among the %doc files. Verify these changes are intended if the package is not a rebase. Sometimes upstream projects rename or move documentation files and the spec file needs to account for those changes.
es: Cambios encontrados entre los archivos %doc. Verifique estos cambios son intencionados si el paquete no es un rebase. Algunas vces renombra los proyectos en proyecto o mueven archivos de documentación y el archivo spec necesarios a cuenta para aquellos cambios.
it: Modifiche trovate tra i file %doc. Verificare che queste modifiche siano intenzionali se il pacchetto non è un rebase. A volte i progetti upstream rinominano o spostano i file di documentazione e il file spec deve tener conto di tali modifiche.

source: An invalid patch file was found. This is usually the result of generating a collection of patches by comparing two trees. When files disappear that can lead to zero length patches in the resulting collection. Check to see if the source package has any zero length or otherwise invalid patches and correct the problem.
it: È stato trovato un file patch non valido. Questo è solitamente il risultato della generazione di una raccolta di patch confrontando due alberi. Quando i file scompaiono, ciò può portare a patch di lunghezza zero nella raccolta risultante. Controllare se il pacchetto sorgente contiene patch di lunghezza zero o altrimenti non valide e correggere il problema.

source: The named patch is defined in the source RPM header (this means it has a PatchN: definition in the spec file) but is not applied anywhere in the spec file. It is missing a corresponding %patch macro and the spec file lacks the %autosetup or %autopatch macros. You can fix this by adding the appropriate %patch macro in the spec file (usually in the %prep section). The number specified with the %patch macro corresponds to the number used to define the patch at the top of the spec file. So Patch47 is applied with either a '%patch 47', '%patch -P 47', '%patch -P47', or '%patch47' macro.
it: La patch specificata è definita nell'intestazione dell'RPM sorgente (ciò significa che ha una definizione PatchN: nel file spec) ma non viene applicata da nessuna parte nel file spec. Manca una macro %patch corrispondente e il file spec manca delle macro %autosetup o %autopatch. È possibile risolvere questo problema aggiungendo la macro %patch appropriata nel file spec (solitamente nella sezione %prep). Il numero specificato con la macro %patch corrisponde al numero utilizzato per definire la patch all'inizio del file spec. Quindi Patch47 viene applicata con una macro '%patch 47', '%patch -P 47', '%patch -P47' o '%patch47'.

source: The named patch is defined but is mismatched by number with the %patch macro. Make sure all numbered patches have corresponding %patch macros. For example, Patch47 needs to have either a '%patch 47', '%patch -P 47', '%patch -P47', or '%patch47' macro.
it: La patch specificata è definita ma non corrisponde per numero alla macro %patch. Assicurarsi che tutte le patch numerate abbiano macro %patch corrispondenti. Ad esempio, Patch47 deve avere una macro '%patch 47', '%patch -P 47', '%patch -P47' o '%patch47'.

source: The defined patch file is not something rpminspect can handle. This is likely a bug and should be reported to the upstream rpminspect project.
it: Il file patch definito non è qualcosa che rpminspect può gestire. Questo è probabilmente un bug e dovrebbe essere segnalato al progetto upstream di rpminspect.

source: ClamAV has found a virus in the named file. This may be a false positive, but you should manually inspect the file in question to ensure it is clean. This may be a problem with the ClamAV database or detection. If you are sure the file in question is clean, please file a bug with rpminspect for further help.
it: ClamAV ha trovato un virus nel file specificato. Potrebbe trattarsi di un falso positivo, ma è consigliabile ispezionare manualmente il file in questione per assicurarsi che sia pulito. Potrebbe trattarsi di un problema con il database o il rilevamento di ClamAV. Se si è sicuri che il file in questione sia pulito, si prega di segnalare un bug a rpminspect per ulteriore assistenza.

source: A file with potential politically sensitive content was found in the package. If this file is permitted, it should be added to the rpminspect vendor data package for the product. Modify the %s file and send a patch to the project that owns it.
it: È stato trovato nel pacchetto un file con contenuto potenzialmente politicamente sensibile. Se questo file è consentito, dovrebbe essere aggiunto al pacchetto dati del fornitore di rpminspect per il prodotto. Modificare il file %s e inviare una patch al progetto che ne è proprietario.

source: Forbidden symbols were found in an ELF file in the package. The configuration settings for rpminspect indicate the named symbols are forbidden in packages. If this is deliberate, you may want to disable the badfuncs inspection. If it is not deliberate, check the man pages for the named symbols to see what API functions have replaced the forbidden symbols. Usually a function is marked as deprecated but still provided in order to allow for backwards compatibility. Whenever possible the deprecated functions should not be used.
it: Simboli vietati sono stati trovati in un file ELF nel pacchetto. Le impostazioni di configurazione per rpminspect indicano che i simboli specificati sono vietati nei pacchetti. Se questo è intenzionale, si potrebbe voler disabilitare l'ispezione badfuncs. Se non è intenzionale, controllare le pagine man per i simboli specificati per vedere quali funzioni API hanno sostituito i simboli vietati. Solitamente una funzione è contrassegnata come deprecata ma ancora fornita per consentire la compatibilità all'indietro. Ove possibile, le funzioni deprecate non dovrebbero essere utilizzate.

source: Either DT_RPATH or DT_RUNPATH properties were found on ELF shared objects in this package. The use of DT_RPATH and DT_RUNPATH is discouraged except in certain situations. Check to see that you a disabling rpath during the %build stage of the spec file. If you are unable to do this easily, you can try using a program such as patchelf to remove these properties from the ELF files.
it: Proprietà DT_RPATH o DT_RUNPATH sono state trovate negli oggetti condivisi ELF in questo pacchetto. L'uso di DT_RPATH e DT_RUNPATH è scoraggiato tranne in determinate situazioni. Controllare di disabilitare rpath durante la fase %build del file spec. Se non è possibile farlo facilmente, si può provare a utilizzare un programma come patchelf per rimuovere queste proprietà dai file ELF.

source: Both DT_RPATH and DT_RUNPATH properties were found in an ELF shared object. This indicates a linker error and should not happen. ELF objects should only carry DT_RPATH or DT_RUNPATH, never both.
it: Entrambe le proprietà DT_RPATH e DT_RUNPATH sono state trovate in un oggetto condiviso ELF. Ciò indica un errore del linker e non dovrebbe accadere. Gli oggetti ELF dovrebbero contenere solo DT_RPATH o DT_RUNPATH, mai entrambi.

source: The rpminspect configuration file contains a list of forbidden Unicode code points. One was found in the extracted and patched source tree or in one of the text source files in the source RPM. Either remove this code point or discuss the situation with the Product Security Team to determine the correct course of action.
it: Il file di configurazione di rpminspect contiene un elenco di punti codice Unicode vietati. Uno è stato trovato nell'albero sorgente estratto e patchato o in uno dei file sorgente di testo nell'RPM sorgente. Rimuovere questo punto codice o discutere la situazione con il Team di Sicurezza del Prodotto per determinare la corretta linea d'azione.

source: The %prep section of the spec file could not be executed for some reason. This usually results from a failure in librpmbuild, which is usually tied to archive extraction problems or the filesystem changing while rpminspect is running. A common cause is removal of the working directory while the program is executing.
it: La sezione %prep del file spec non ha potuto essere eseguita per qualche motivo. Questo solitamente deriva da un errore in librpmbuild, che è solitamente legato a problemi di estrazione dell'archivio o a modifiche del filesystem mentre rpminspect è in esecuzione. Una causa comune è la rimozione della directory di lavoro mentre il programma è in esecuzione.

source: Unexpanded RPM spec file macros were found in the noted dependency rule. Check the spec file for this dependency and ensure you have not misspelled a macro or used a macro name that does not exist.
it: Macro del file spec RPM non espanse sono state trovate nella regola di dipendenza indicata. Controllare il file spec per questa dipendenza e assicurarsi di non aver scritto male una macro o utilizzato un nome di macro che non esiste.

source: Add the indicated explicit Requires to the spec file for the named subpackage. Subpackages depending on shared libraries in another subpackage must carry an explicit 'Requires: SUBPACKAGE_NAME = %{version}-%{release}' in the spec file.
it: Aggiungere la direttiva Requires esplicita indicata al file spec per il sotto-pacchetto specificato. I sotto-pacchetti che dipendono da librerie condivise in un altro sotto-pacchetto devono contenere un 'Requires: NOME_SOTTOPACCHETTO = %{version}-%{release}' esplicito nel file spec.

source: Add the indicated explicit Requires to the spec file for the named subpackage. Subpackages depending on shared libraries in another subpackage must carry an explicit 'Requires: SUBPACKAGE_NAME = %{epoch}:%{version}-%{release}' in the spec file.
it: Aggiungere la direttiva Requires esplicita indicata al file spec per il sotto-pacchetto specificato. I sotto-pacchetti che dipendono da librerie condivise in un altro sotto-pacchetto devono contenere un 'Requires: NOME_SOTTOPACCHETTO = %{epoch}:%{version}-%{release}' esplicito nel file spec.

source: Check subpackage %files sections and explicit Provides statements. Only one subpackage should provide a given shared library. Shared library names are automatically added as Provides, so there is no need to specify them in the spec file but you do need to make sure only one subpackage is packaging up the shared library in question.
it: Controllare le sezioni %files dei sotto-pacchetti e le dichiarazioni Provides esplicite. Solo un sotto-pacchetto dovrebbe fornire una data libreria condivisa. I nomi delle librerie condivise vengono aggiunti automaticamente come Provides, quindi non è necessario specificarli nel file spec, ma è necessario assicurarsi che solo un sotto-pacchetto stia impacchettando la libreria condivisa in questione.

source: A dependency listed in the before build changed to the indicated dependency in the after build. If this is a VERIFY result, it means rpminspect noticed the change in what it considers a maintenance update in a package. An INFO result means it noticed this change, but deems it ok because it is comparing a rebased build.
it: Una dipendenza elencata nella build precedente è cambiata nella dipendenza indicata nella build successiva. Se questo è un risultato VERIFY, significa che rpminspect ha notato la modifica in quello che considera un aggiornamento di manutenzione in un pacchetto. Un risultato INFO significa che ha notato questa modifica, ma la ritiene accettabile perché sta confrontando una build ribasata (rebased).

source: A new dependency is seen in the after build that was not present in the before build. If this is a VERIFY result, it means rpminspect noticed the change in what it considers a maintenance update in a package. An INFO result means it noticed this change, but deems it ok because it is comparing a rebased build.
it: Una nuova dipendenza è presente nella build successiva che non era presente nella build precedente. Se questo è un risultato VERIFY, significa che rpminspect ha notato la modifica in quello che considera un aggiornamento di manutenzione in un pacchetto. Un risultato INFO significa che ha notato questa modifica, ma la ritiene accettabile perché sta confrontando una build ribasata (rebased).

source: A dependency seen in the before build is not seen in the after build meaning it was removed or lost. If this is a VERIFY result, it means rpminspect noticed the change in what it considers a maintenance update in a package. An INFO result means it noticed this change, but deems it ok because it is comparing a rebased build.
it: Una dipendenza vista nella build precedente non è vista nella build successiva, il che significa che è stata rimossa o persa. Se questo è un risultato VERIFY, significa che rpminspect ha notato la modifica in quello che considera un aggiornamento di manutenzione in un pacchetto. Un risultato INFO significa che ha notato questa modifica, ma la ritiene accettabile perché sta confrontando una build ribasata (rebased).

source: The package has an Epoch value greater than zero, but the explicit subpackage dependencies are not consistently using it. For the dependency reported, the '= %{version}-%{release}' needs to change to '= %{epoch}:%{version}-%{release}' to capture the package package Epoch in the dependency.
it: Il pacchetto ha un valore Epoch maggiore di zero, ma le dipendenze esplicite dei sotto-pacchetti non lo utilizzano in modo coerente. Per la dipendenza segnalata, '= %{version}-%{release}' deve cambiare in '= %{epoch}:%{version}-%{release}' per includere l'Epoch del pacchetto nella dipendenza.

source: Refer to the udev documentation at https://www.freedesktop.org/software/systemd/man/udev.html for help correcting the errors and warnings.
it: Fare riferimento alla documentazione di udev su https://www.freedesktop.org/software/systemd/man/udev.html per aiuto nella correzione degli errori e degli avvisi.

source: *** malformed ABI level identifier: %s
es: *** identificador de nivel de ABI malformado: %s
it: *** identificatore di livello ABI malformato: %s

source: *** ABI level %d already defined
es: *** nivel ABI %d ya definido
it: *** livello ABI %d già definito

source: *** malformed ABI level entry: %s
es: *** apunte de nivel ABI malformado: %s
it: *** voce di livello ABI malformata: %s

source: *** unable to create download directory %s
es: *** no es capaz de crear el directorio de descarga %s
it: *** impossibile creare la directory di download %s

source: *** unknown working directory type: %d
es: *** tipo desconocido del directorio de trabajo: %d
it: *** tipo di directory di lavoro sconosciuto: %d

source: *** unable to read %s, skipping
es: *** no es capaz de leer %s, se hace caso omiso
it: *** impossibile leggere %s, salto

source: *** unknown directory member encountered: %s
es: *** miembro de directorio desconocido encontrado: %s
it: *** incontrato membro di directory sconosciuto: %s

source: There is not enough available space to download the requested %s.
es: No hay suficiente espacio disponible para descargar el %s solicitado.
it: Non c'è abbastanza spazio disponibile per scaricare %s richiesto.

source: Need %s in %s, have %s.
es: Necesita %s interno a %s, tiene %s.
it: Necessari %s in %s, disponibili %s.

source: See the `-w' option for specifying an alternate working directory.
es: Consulte la opción `-w` para especificar un directorio de trabajo alterno.
it: Vedere l'opzione `-w' per specificare una directory di lavoro alternativa.

source: Unable to determine the required space to download the requested %s.
es: No es capaz de determinar el espacio requerido para descargar el %s solicitado.
it: Impossibile determinare lo spazio necessario per scaricare %s richiesto.

source: Ensure %s has sufficient space available.
es: Asegúrese que %s tenga suficiente espacio disponible.
it: Assicurarsi che %s abbia spazio sufficiente disponibile.

source: Downloading module
es: Descargar módulo
it: Download del modulo

source: Downloading RPM build
es: Descargar compilación RPM
it: Download della build RPM

source: *** ignoring malformed module metadata file: %s
es: *** se ignora archivo de metadatos del módulo malformado: %s
it: *** ignoro file metadati modulo malformato: %s

source: *** malformed rpm filters in file: %s
es: *** filtros rpm malformados en archivo: %s
it: *** filtri rpm malformati nel file: %s

source: *** `%s' already exists in %s
es: *** `%s' ya existe en %s
it: *** `%s' esiste già in %s

source: *** unable to find local build: %s
es: *** no es capaz de encontrar la compilación local: %s
it: *** impossibile trovare build locale: %s

source: *** unable to download RPM: %s
es: *** no es capaz de descargar RPM: %s
it: *** impossibile scaricare RPM: %s

source: *** unable to find build %s in Koji hub %s
es: *** no es capaz de encontrar la compilación %s en hub Koji %s
it: *** impossibile trovare build %s nell'hub Koji %s

source: *** unable to find task %s in Koji hub %s
es: *** no es capaz de encontrar la tarea %s en hub Koji %s
it: *** impossibile trovare task %s nell'hub Koji %s

source: *** %s is a FIFO
es: *** %s es una FIFO
it: *** %s è un FIFO

source: %s already exists
es: %s ya existe
it: %s esiste già

source: , overwriting
es: , sobrescribiendo
it: , sovrascrivo

source: *** unable to read %s
es: *** no es capaz de leer %s
it: *** impossibile leggere %s

source: %s in %s on %s carries expected mode %04o
es: %s interno a %s en %s porta el modo %04o esperado
it: %s in %s su %s ha la modalità prevista %04o
