Repository: rpminspect/rpminspect-l10n
Catalog: *.po
Languages: es, it

source: Object has executable stack (no GNU-stack note): %s on %s
es: Objeto tiene pila ejecutable (nota no pila GNU): %s sobre %s
it: L'oggetto ha stack eseguibile (nessuna nota GNU-stack): %s su %s

source: Program built without GNU_STACK: %s on %s
es: Programa comprimido sin GNU_STACK: %s sobre %s
it: Programma compilato senza GNU_STACK: %s su %s

source: GNU_STACK in ${FILE} on ${ARCH}
it: GNU_STACK in ${FILE} su ${ARCH}

source: File %s has invalid execstack flags (%s) on %s
es: Archivo %s tiene indicadores de pila ejecutable no válida (%s) sobre %s
it: Il file %s ha flag execstack non validi (%s) su %s

source: File %s has unrecognized GNU_STACK '%s' (expected RW or RWE) on %s
es: Archivo %s tiene pila GNU_STACK '%s' no reconocida (esperaba RW o RWE) sobre %s
it: Il file %s ha GNU_STACK '%s' non riconosciuto (previsto RW o RWE) su %s

source: execstack in ${FILE} on ${ARCH}
es: pila ejecutable en ${FILE} sobre ${ARCH}
it: execstack in ${FILE} su ${ARCH}

source: Object still has executable stack (GNU-stack note = X): %s on %s
es: Objeto aún tiene pila ejecutable (Nota de pila-GNU = X): %s sobre %s
it: L'oggetto ha ancora stack eseguibile (nota GNU-stack = X): %s su %s

source: Object has executable stack (GNU-stack note = X): %s on %s
es: Objeto tiene pila ejecutable (Nota Pila GNU = X): %s en %s
it: L'oggetto ha stack eseguibile (nota GNU-stack = X): %s su %s

source: Stack is still executable: %s on %s
es: Pila aún es ejecutable: %s sobre %s
it: Lo stack è ancora eseguibile: %s su %s

source: Stack is executable: %s on %s
es: Pila es ejecutable: %s sobre %s
it: Lo stack è eseguibile: %s su %s

source: %s lost full GNU_RELRO security protection on %s
es: %s pierde protección completa de seguridad de GNU_RELRO sobre %s
it: %s ha perso la protezione di sicurezza GNU_RELRO completa su %s

source: %s lost GNU_RELRO security protection on %s
es: %s pierde protección de seguridad de GNU_RELRO sobre %s
it: %s ha perso la protezione di sicurezza GNU_RELRO su %s

source: lost GNU_RELRO in ${FILE} on ${ARCH}
es: perdió GNU_RELRO dentro de ${FILE} para ${ARCH}
it: perso GNU_RELRO in ${FILE} su ${ARCH}

source: The following objects lost -fPIC:
es: Los siguientes objetos perdidos -fPIC:
it: I seguenti oggetti hanno perso -fPIC:

source: The following new objects were built without -fPIC:
es: Los siguientes objetos siguientes fueron compilados sin -fPIC:
it: I seguenti nuovi oggetti sono stati compilati senza -fPIC:

source: %s in %s has objects built without -fPIC on %s
es: %s en %s tiene objetos compilados sin -fPIC sobre %s
it: %s in %s ha oggetti compilati senza -fPIC su %s

source: missing -fPIC in ${FILE} on ${ARCH}
es: falta -fPIC en ${FILE} en ${ARCH}
it: manca -fPIC in ${FILE} su ${ARCH}

source: TEXTREL relocations in ${FILE} on ${ARCH}
es: TEXTREL de reubicaciones internas a ${FILE} en ${ARCH}
it: Rilocazioni TEXTREL in ${FILE} su ${ARCH}

source: %s in %s acquired TEXTREL relocations on %s
es: %s dentro de %s adquirió TEXTREL reubicaciones en %s
it: %s in %s ha acquisito rilocazioni TEXTREL su %s

source: %s in %s has TEXTREL relocations on %s
es: %s dentro de %s tiene TEXTREL reubicaciones en %s
it: %s in %s ha rilocazioni TEXTREL su %s

source: New package %s is empty (no payloads); this is expected per the rpminspect configuration
es: Nuevo paquete %s está vacío (sin cargas útiles); esto es esperado por la configuración rpminspect
it: Il nuovo pacchetto %s è vuoto (nessun payload); questo è previsto secondo la configurazione di rpminspect

source: New package %s is empty (no payloads); this is expected because the package only contains %%ghost entries
es: Paquete %s nuevo está vacío (sin cargas útiles); esto es esperado porque el paquete solo contiene apuntes %%ghost
it: Il nuovo pacchetto %s è vuoto (nessun payload); questo è previsto perché il pacchetto contiene solo voci %%ghost

source: New package %s is empty (no payloads)
es: Paquete %s nuevo está vacío (sin cargas útiles)
it: Il nuovo pacchetto %s è vuoto (nessun payload)

source: ${FILE} has empty payload
es: ${FILE} tiene de carga útil vacía
it: ${FILE} ha payload vuoto

source: Forbidden path reference (%s) on line %ld of %s
es: Ruta referencial prohibida (%s) en la línea %ld de %s
it: Riferimento a percorso proibito (%s) alla riga %ld di %s

source: invalid spec line: %s
es: línea spec no válida: %s
it: riga spec non valida: %s

source: The files inspection is only for source packages, skipping.
es: La inspección de archivos solo es para paquetes fuentes, se descarta.
it: L'ispezione dei file è solo per i pacchetti sorgente, salto.

source: %s became a non-empty file on %s
es: %s se vuelve un archivo no vacío en %s
it: %s è diventato un file non vuoto su %s

source: non-empty ${FILE} on ${ARCH}
es: ${FILE} no vacío sobre ${ARCH}
it: file non vuoto ${FILE} su ${ARCH}

source: %s became an empty file on %s
es: %s vuelve un archivo vacío en %s
it: %s è diventato un file vuoto su %s

source: empty ${FILE} on ${ARCH}
es: ${FILE} vacío en ${ARCH}
it: file vuoto ${FILE} su ${ARCH}

source: %s grew by %lld%% on %s
es: %s creció por %lld%% sobre %s
it: %s è cresciuto del %lld%% su %s

source: ${FILE} size grew on ${ARCH}
es: ${FILE} con tamaño creciente sobre ${ARCH}
it: dimensione di ${FILE} cresciuta su ${ARCH}

source: %s shrank by %lld%% on %s
it: %s si è ridotto del %lld%% su %s

source: ${FILE} size shrank on ${ARCH}
es: ${FILE} con tamaño menguante sobre ${ARCH}
it: dimensione di ${FILE} ridotta su ${ARCH}

source: File %s (%s), Java byte code version %d is incorrect (wrong endianness? corrupted file? space JDK?)
es: Archivo %s (%s), código de byte Java con versión %d es incorrecto (¿endianness incorrecta? ¿archivo corrompido? ¿espacio JDK?)
it: File %s (%s), versione bytecode Java %d non corretta (endianness errata? file corrotto? JDK spaziale?)

source: incorrect Java byte code version in ${FILE}
es: Versión de código byte Java incorrecta en ${FILE}
it: versione bytecode Java non corretta in ${FILE}

source: File %s (%s), Java byte code version %d greater than supported major version %d for product release %s
es: Archivo %s (%s), versión de código byte Java %d mayor que versión principal %d admitida para producto de liberación %s
it: File %s (%s), versione bytecode Java %d maggiore della versione principale supportata %d per il rilascio del prodotto %s

source: Java byte code version too new in ${FILE}
es: Versión de código byte Java muy nuevo en ${FILE}
it: Versione bytecode Java troppo recente in ${FILE}

source: Java byte code version changed from %d to %d in %s from %s
es: Versión de código byte de Java cambiado desde %d a %d en %s desde %s
it: Versione bytecode Java cambiata da %d a %d in %s da %s

source: Java byte code version changed in ${FILE}
es: Versión de código byte Java cambiada en ${FILE}
it: Versione bytecode Java cambiata in ${FILE}

source: *** missing JVM version to product release mapping
es: *** versión JVM ausente para producto de publicación asignada
it: *** mappatura mancante tra versione JVM e rilascio prodotto

source: Comparing %s to %s in package %s on %s generated a kmidiff(1) usage error.
es: Comparando %s a %s dentro del paquete %s sobre %s generado un error de uso kmidiff(1).
it: Confronto tra %s e %s nel pacchetto %s su %s ha generato un errore di uso di kmidiff(1).

source: kmidiff usage error
es: error de uso kmidiff
it: errore uso kmidiff

source: Comparing %s to %s in package %s on %s revealed Kernel Module Interface (KMI) differences.
es: Comparando %s a %s en paquete %s sobre %s reveló diferencias Interfaz de Módulo de Kernel (KMI).
it: Confronto tra %s e %s nel pacchetto %s su %s ha rivelato differenze nell'Interfaccia del Modulo Kernel (KMI).

source: KMI change in ${FILE} on ${ARCH}
es: Cambio KMI en ${FILE} en ${ARCH}
it: Modifica KMI in ${FILE} su ${ARCH}

source: Comparing %s to %s in package %s on %s revealed incompatible Kernel Module Interface (KMI) differences.
es: Compara %s a %s en paquete %s sobre %s revelado diferencias de Interfaz de Módulo de Kernel (KMI) incompatible.
it: Confronto tra %s e %s nel pacchetto %s su %s ha rivelato differenze incompatibili nell'Interfaccia del Modulo Kernel (KMI).

source: KMI incompatible change in ${FILE} on ${ARCH}
es: Cambio incompatible de KMI en ${FILE} sobre ${ARCH}
it: Modifica KMI incompatibile in ${FILE} su ${ARCH}

source: kmidiff(1) comparison of %s to %s in package %s on %s ended unexpectedly.
es: Comparación kmidiff(1) de %s a %s dentro del paquete %s sobre %s finalizado inesperadamente.
it: Confronto kmidiff(1) tra %s e %s nel pacchetto %s su %s terminato inaspettatamente.

source: kmidiff unexpected exit
es: salida kmidiff inesperada
it: uscita inattesa di kmidiff

source: Command: %s Exit code: %d%s%s
es: Instrucción: %s Salida de código: %d%s%s
it: Comando: %s Codice di uscita: %d%s%s

source: ${FILE} kernel module alias on ${ARCH}
es: ${FILE} alias del módulo de kernel en ${ARCH}
it: alias modulo kernel ${FILE} su ${ARCH}

source: Kernel module '%s' lost alias '%s'
es: Módulo del kernel '%s' perdió alias '%s'
it: Modulo kernel '%s' ha perso l'alias '%s'

source: Kernel module '%s' gained alias '%s'
es: Módulo del kernel '%s' ganó alias '%s'
it: Modulo kernel '%s' ha acquisito l'alias '%s'

source: Kernel module %s removes parameter '%s' (was present in %s).
es: Módulo %s de kernel retira parámetro '%s' (era presente en %s).
it: Modulo kernel %s rimuove il parametro '%s' (era presente in %s).

source: ${FILE} kernel module parameter on ${ARCH}
es: Parámetro ${FILE} del módulo del kernel en ${ARCH}
it: parametro modulo kernel ${FILE} su ${ARCH}

source: Kernel module %s adds parameter '%s' (was not present in %s).
es: Módulo de kernel %s añade parámetro '%s' (era no presente en %s).
it: Modulo kernel %s aggiunge il parametro '%s' (non era presente in %s).

source: Kernel module %s removes dependency '%s' (was present in %s).
es: Módulo de kernel %s retira dependencia '%s' (fue presente en %s).
it: Modulo kernel %s rimuove la dipendenza '%s' (era presente in %s).

source: ${FILE} kernel module dependency on ${ARCH}
es: ${FILE} dependencia de módulo del kernel sobre ${ARCH}
it: dipendenza modulo kernel ${FILE} su ${ARCH}

source: Kernel module %s adds dependency '%s' (was not present in %s).
es: Módulo de kernel %s añade dependencia '%s' (no era presente en %s).
it: Modulo kernel %s aggiunge la dipendenza '%s' (non era presente in %s).

source: ${FILE} kernel module parameter
es: ${FILE} parámetro del módulo del kernel
it: parametro modulo kernel ${FILE}

source: *** parse error in license database %s
es: *** error de intérprete en base de datos de licencia %s
it: *** errore di analisi nel database delle licenze %s

source: *** problem checking license database
es: *** problema comprobando base de datos de licencia
it: *** problema nel controllo del database delle licenze

source: Unapproved license in %s: %s
es: Licencia inapropiada en %s: %s
it: Licenza non approvata in %s: %s

source: Empty License Tag in %s
es: Etiquetado de License vacío en %s
it: Tag License vuoto in %s

source: missing License tag in ${FILE}
es: etiqueta de License ausente en ${FILE}
it: tag License mancante in ${FILE}

source: Valid License Tag in %s: %s
es: Etiqueta de License Válida en %s: %s
it: Tag License valido in %s: %s

source: License Tag contains unprofessional language in %s: %s
es: Etiqueta License contiene idioma no profesional en %s: %s
it: Il tag License contiene linguaggio non professionale in %s: %s

source: unprofessional language in License tag in ${FILE}
es: idioma no profesional en etiqueta de License en ${FILE}
it: linguaggio non professionale nel tag License in ${FILE}

source: Missing license database(s).
es: Licencia ausente en base de datos.
it: Database delle licenze mancante/i.

source: missing license database
es: licencia ausente en base de datos
it: database delle licenze mancante

source: Existing subpackage %s is now missing on %s
es: Existiendo subpaquete %s ahora falta en %s
it: Il sotto-pacchetto esistente %s è ora mancante su %s

source: missing subpackage ${FILE} on ${ARCH}
es: subpaquete ausente ${FILE} en el ${ARCH}
it: sotto-pacchetto mancante ${FILE} su ${ARCH}

source: Package %s on %s continues to be empty (no payloads)
es: Paquete %s en %s continua para estar vacío (sin cargas útiles)
it: Il pacchetto %s su %s continua ad essere vuoto (nessun payload)

source: existing empty subpackage ${FILE} on ${ARCH}
es: existiendo subpaquete ${FILE} vacío en ${ARCH}
it: sotto-pacchetto vuoto esistente ${FILE} su ${ARCH}

source: Package %s on %s became empty (no payloads)
es: Paquete %s en %s se vuelve vacío (sin carga útil)
it: Il pacchetto %s su %s è diventato vuoto (nessun payload)

source: subpackage ${FILE} on ${ARCH} now has empty payload
es: subpaquete ${FILE} sobre ${ARCH} ahora tiene carga útil vacía
it: il sotto-pacchetto ${FILE} su ${ARCH} ora ha un payload vuoto

source: ${FILE} not portable on ${ARCH}
es: ${FILE} no portable en ${ARCH}
it: ${FILE} non portabile su ${ARCH}

source: %s contains symbols [%s] on %s; this is not portable across compiler versions
es: %s contiene símbolos [%s] sobre %s; esto no es portable a través de versiones de compilador
it: %s contiene simboli [%s] su %s; questo non è portabile tra versioni del compilatore

source: %s contains symbol [%s] on %s; this is not portable across compiler versions
es: %s contiene símbolo [%s] sobre %s; esto no es portable a través de versiones de compilador
it: %s contiene il simbolo [%s] su %s; questo non è portabile tra versioni del compilatore

source: Error parsing %s:%d:%d: %s: %s: %s
es: Error interpretando %s:%d:%d: %s: %s: %s
it: Errore analisi %s:%d:%d: %s: %s: %s

source: *** unable to compile man page path regular expression: %s
es: *** no es capaz de compilar página man con expresión regular de ruta: %s
it: *** impossibile compilare l'espressione regolare del percorso della pagina man: %s

source: Unable to open man page %s
es: No es capaz de abrir la página man %s
it: Impossibile aprire la pagina man %s

source: Man page %s does not end in %s
es: Página man %s no termina en %s
it: La pagina man %s non termina con %s

source: man page with %s suffix is not really compressed with gzip
es: página man con sufijo %s no está realmente comprimida con gzip
it: la pagina man con suffisso %s non è realmente compressa con gzip

source: Errors found validating %s
es: Errores encontrados validando %s
it: Errori trovati durante la validazione di %s

source: Man page %s is possibly empty on %s in %s
es: Página man %s es posiblemente vacía en %s dentro de %s
it: La pagina man %s è possibilmente vuota su %s in %s

source: empty man page ${FILE} on ${ARCH}
es: página man vacía ${FILE} sobre ${ARCH}
it: pagina man vuota ${FILE} su ${ARCH}

source: Man page checker reported problems with %s on %s in %s
es: Comprobante de página man informó problemas con %s sobre %s en %s
it: Il controllo della pagina man ha segnalato problemi con %s su %s in %s

source: man page ${FILE} on ${ARCH} has errors
es: página man ${FILE} sobre ${ARCH} tiene errores
it: la pagina man ${FILE} su ${ARCH} ha errori

source: Man page %s has incorrect path on %s in %s
es: Página man %s tiene ruta incorrecta sobre %s en %s
it: Pagina man %s ha un percorso errato su %s in %s

source: man page ${FILE} on ${ARCH} has incorrect path
es: página man ${FILE} en ${ARCH} tiene ruta incorrecta
it: la pagina man ${FILE} su ${ARCH} ha un percorso errato

source: Vendor not set in the rpminspect configuration, ignoring Package Vendor "%s" in %s
es: Proveedor no fija dentro de la configuración rpminspect, se hace caso omiso a Package Vendor "%s" en %s
it: Vendor non impostato nella configurazione di rpminspect, ignoro il Vendor del pacchetto "%s" in %s

source: Package Vendor "%s" is not "%s" in %s
es: Paquete Proveedor "%s" no es "%s" en %s
it: Vendor del pacchetto "%s" non è "%s" in %s

source: invalid vendor ${FILE} on ${ARCH}
es: proveedor ${FILE} no válido sobre ${ARCH}
it: vendor non valido ${FILE} su ${ARCH}

source: Package Build Host "%s" is not within an expected build host subdomain in %s
es: Paquete Compilador Huésped "%s" no está dentro de un subdominio de huésped esperado en %s
it: L'host di compilazione del pacchetto "%s" non si trova in un sottodominio dell'host di compilazione previsto in %s

source: invalid build host ${FILE} on ${ARCH}
it: host di compilazione non valido ${FILE} su ${ARCH}

source: Package Summary contains unprofessional language in %s
it: Il riepilogo del pacchetto contiene linguaggio non professionale in %s

source: Summary: %s
es: Sumario: %s
it: Riepilogo: %s

source: Summary contains unprofessional words on ${ARCH}
es: Sumario contiene palabras no profesionales en ${ARCH}
it: Il riepilogo contiene parole non professionali su ${ARCH}

source: Package Description contains unprofessional language in %s:
es: Descripción de paquete contiene idioma no profesional en %s:
it: La descrizione del pacchetto contiene linguaggio non professionale in %s:

source: Description contains unprofessional words on ${ARCH}
es: Descripción contiene palabras no profesionales en ${ARCH}
it: La descrizione contiene parole non professionali su ${ARCH}

source: Gained Package Vendor "%s" in %s
es: Ganado Proveedor del Paquete «%s» en %s
it: Acquisito Vendor del pacchetto "%s" in %s

source: Lost Package Vendor "%s" in %s
es: Proveedor de Paquete Perdido "%s" en %s
it: Perso Vendor del pacchetto "%s" in %s

source: Package Vendor changed from "%s" to "%s" in %s
es: Proveedor de Paquete cambiado desde "%s" a "%s" en %s
it: Vendor del pacchetto cambiato da "%s" a "%s" in %s

source: Package Summary change from "%s" to "%s" in %s
it: Riepilogo del pacchetto cambiato da "%s" a "%s" in %s

source: Package Description changed in %s
es: Descripción de Paquete cambiado en %s
it: Descrizione del pacchetto modificata in %s

source: from: %s to: %s
es: origen: %s destino: %s
it: da: %s a: %s

source: The /data/static_context value in %s is %s, but the product release rules forbid the presence of /data/static_context in the module metadata.
es: El valor /data/static_context en %s es %s, pero el producto de reglas de liberación prohíbe la presencia de /data/static_context dentro de los metadatos del módulo.
it: Il valore /data/static_context in %s è %s, ma le regole di rilascio del prodotto vietano la presenza di /data/static_context nei metadati del modulo.

source: The /data/static_context value in %s is %s, but the product release rules require the presence of /data/static_context in the module metadata.
es: El valor de /data/static_context dentro de %s es %s, pero las reglas de liberación del producto requiere la presencia de /data/static_context dentro de los metadatos del módulo.
it: Il valore /data/static_context in %s è %s, ma le regole di rilascio del prodotto richiedono la presenza di /data/static_context nei metadati del modulo.

source: The /data/static_context value in %s is %s, but the product release rules recommend the presence of /data/static_context in the module metadata.
es: El valor de /data/static_context dentro de %s es %s, pero las reglas de liberación del producto recomendó la presencia de /data/static_context dentro de los metadatos del módulo.
it: Il valore /data/static_context in %s è %s, ma le regole di rilascio del prodotto raccomandano la presenza di /data/static_context nei metadati del modulo.

source: The /data/static_context value in %s is %s, and the product release rules do not have a setting for /data/static_context in the module metadata.
es: El valor de /data/static_context dentro de %s es %s, y las reglas de liberación del producto no tiene unos parámetros para /data/static_context dentro de los metadatos del módulo.
it: Il valore /data/static_context in %s è %s, e le regole di rilascio del prodotto non hanno un'impostazione per /data/static_context nei metadati del modulo.

source: The /data/static_context value in %s is %s as required by the product release rules.
es: El valor de /data/static_context dentro de %s es %s como requirió por las reglas de liberación del producto.
it: Il valore /data/static_context in %s è %s come richiesto dalle regole di rilascio del prodotto.

source: %s The /data/static_context value is the same as in %s.
es: El valor %s de /data/static_context es el mismo que en %s.
it: %s Il valore /data/static_context è lo stesso di %s.

source: %s The /data/static_context value has changed since %s.
es: El valor de /data/static_context %s ha cambiado desde %s.
it: %s Il valore /data/static_context è cambiato da %s.

source: Package "%s" is part of a module but lacks the '%%{modularitylabel}' header tag.
es: El paquete "%s" es parte de un módulo pero le falta la cabecera '%%{modularitylabel}' de etiqueta.
it: Il pacchetto "%s" fa parte di un modulo ma manca del tag di intestazione '%%{modularitylabel}'.

source: Inspection skipped because this build's type is not `module'.
es: Inspección omitida porque este tipo de compilación no es `module'.
it: Ispezione saltata perché il tipo di questa compilazione non è `modulo'.

source: %s moved to ${FILE} on ${ARCH}
es: %s movido a ${FILE} en ${ARCH}
it: %s spostato in ${FILE} su ${ARCH}

source: %s probably moved to %s on %s
es: %s probablemente movido a %s sobre %s
it: %s probabilmente spostato in %s su %s

source: File %s has forbidden owner `%s` on %s
es: Archivo %s tiene propietario `%s` prohibido sobre %s
it: Il file %s ha un proprietario vietato `%s` su %s

source: forbidden owner for ${FILE} on ${ARCH}
es: propietario prohibido para ${FILE} sobre ${ARCH}
it: proprietario vietato per ${FILE} su ${ARCH}

source: File %s has forbidden group `%s` on %s
es: Archivo %s ha prohibido grupo `%s` sobre %s
it: Il file %s ha un gruppo vietato `%s` su %s

source: forbidden group for ${FILE} on ${ARCH}
es: grupo prohibido para ${FILE} sobre ${ARCH}
it: gruppo vietato per ${FILE} su ${ARCH}

source: File %s has owner `%s` on %s, but should be `%s`
es: Archivo %s tiene propietario `%s` sobre %s, pero sería `%s`
it: Il file %s ha proprietario `%s` su %s, ma dovrebbe essere `%s`

source: invalid owner for ${FILE} on ${ARCH}
es: propietario inválido para ${FILE} en ${ARCH}
it: proprietario non valido per ${FILE} su ${ARCH}

source: File %s on %s has CAP_SETUID capability but group `%s` and is world executable
es: Archivo %s en %s tiene capacidad CAP_SETUID pero grupo `%s` y es ejecutable por todos
it: Il file %s su %s ha la capacità CAP_SETUID ma il gruppo è `%s` ed è eseguibile da tutti (world executable)

source: CAP_SETUID and o+x for ${FILE} on ${ARCH}
es: CAP_SETUID y o+x para ${FILE} en {ARCH}
it: CAP_SETUID e o+x per ${FILE} su ${ARCH}

source: File %s on %s has CAP_SETUID capability but group `%s` and is group writable
es: Archivo %s en %s tiene capacidad CAP_SETUID pero grupo `%s` y es escribible por el grupo
it: Il file %s su %s ha la capacità CAP_SETUID ma il gruppo è `%s` ed è scrivibile dal gruppo (group writable)

source: CAP_SETUID and g+w for ${FILE} on ${ARCH}
es: CAP_SETUID y g+w para ${FILE} sobre ${ARCH}
it: CAP_SETUID e g+w per ${FILE} su ${ARCH}

source: File %s has group `%s` on %s, but should be `%s`
es: Archivo %s tiene grupo `%s` sobre %s, pero sería `%s`
it: Il file %s ha gruppo `%s` su %s, ma dovrebbe essere `%s`

source: invalid group for ${FILE} on ${ARCH}
es: grupo no válido para ${FILE} sobre ${ARCH}
it: gruppo non valido per ${FILE} su ${ARCH}

source: File %s changed %s from `%s` to `%s` on %s
es: Archivo %s cambiado %s desde `%s` a `%s` sobre %s
it: Il file %s ha cambiato %s da `%s` a `%s` su %s

source: ${FILE} changed owner on ${ARCH}
es: ${FILE} cambió propietario sobre ${ARCH}
it: ${FILE} ha cambiato proprietario su ${ARCH}
