Repository: rpminspect/rpminspect-l10n
Catalog: *.po
Languages: es, it

source: The Release: tag in the spec file must include a '%{?dist}' string. Please add this to the spec file per the distribution packaging guidelines.
es: La etiqueta Release: en el archivo spec debe incluir una cadena '%{?dist}'. Añada esto para el archivo spec por la líneas de guía del empaquetado de la distribución.
it: Il tag Release: nel file spec deve includere una stringa '%{?dist}'. Si prega di aggiungerlo al file delle specifiche secondo le linee guida sul pacchetto di distribuzione.

source: The spec file name does not match the expected NAME.spec format. Rename the spec file to conform to this policy.
es: El nombre del archivo spec no coincide con el formato NOMBRE.spec especificado. Renombre el archivo spec para estar en conforme a esta normativa.
it: Il nome del file spec non corrisponde al formato NAME.spec previsto. Rinominare il file delle specifiche per conformarsi a questa policy.

source: This package is part of a module but is missing the %{modularitylabel} header tag. Add this as a %define in the spec file and rebuild.
es: Este paquete es parte de un módulo pero le falta la etiqueta de cabecera %{modularitylabel}. Añade esto como una %define dentro del archivo spec y recompile.
it: Questo pacchetto fa parte di un modulo ma manca il tag di intestazione %{modularitylabel}. Aggiungilo come %define nel file spec e ricostruisci.

source: This build either contains a valid or invalid /data/static_context setting. Refer to the module rules for the product you are building to determine what the setting should be. The rpminspect configuration settings also set the rules determining if the /data/static_context setting is required, forbidden, or recommend.
es: Esta compilación contiene una configuración de /data/static_context válida o no válida. Consulte las reglas del módulo del producto que está compilando para determinar cuál debería ser la configuración. La configuración de rpminspect también define las reglas que determinan si la configuración de /data/static_context es obligatoria, prohibida o recomendada.
it: Questa build contiene un'impostazione /data/static_context valida o non valida. Fai riferimento alle regole del modulo per il prodotto che stai creando per determinare quale dovrebbe essere l'impostazione. Le impostazioni di configurazione di rpminspect impostano anche le regole che determinano se l'impostazione /data/static_context è richiesta, vietata o consigliata.

source: The Java bytecode version for one or more class files in the build was not met for the product release. Ensure you are using the correct JDK for the build.
es: La versión del bytecode de Java para uno o más archivos de clase de la compilación no se cumplió para la versión del producto. Asegúrese de utilizar el JDK correcto para la compilación.
it: La versione del bytecode Java per uno o più file di classe nella build non è stata soddisfatta per il rilascio del prodotto. Assicurati di utilizzare il JDK corretto per la build.

source: File changes were found. In most cases these are expected, but it is a good idea to verify the changes found are deliberate.
es: Cambios de archivo fueron encontrados. En muchos casos hay esperados, pero es buena idea verificar los cambios encontrados al entregar.
it: Sono state trovate modifiche al file. Nella maggior parte dei casi questi sono previsti, ma è una buona idea verificare che i cambiamenti riscontrati siano intenzionali.

source: Unexpected file moves were found. Verify these changes are correct. If they are not, adjust the build to prevent the file moves between builds.
es: Movimiento de archivo inesperado encontrado. Verifique que estos cambios sean correctos. Si no lo son, ajunte la compilación para prevenir que los archivos se muevan entre compilaciones.
it: Sono stati rilevati spostamenti di file imprevisti. Verificare che queste modifiche siano corrette. In caso contrario, modificare la build per evitare che il file si sposti tra una build e l'altra.

source: Unexpected file removals were found. Verify these changes are correct. If they are not, adjust the build to prevent the file removals between builds.
es: Fue encontrado archivo inesperado retirado. Verifique estos cambios sean correctos. Si no lo son, ajuste la compilación para prevenir las retiradas de archivo entre compilaciones.
it: Sono state rilevate rimozioni di file impreviste. Verificare che queste modifiche siano corrette. In caso contrario, modificare la build per impedire la rimozione dei file tra una build e l'altra.

source: Unexpected file additions were found. Verify these changes are correct. If they are not, adjust the build to prevent the file additions between builds. If they are correct, update %s and send a patch to the rpminspect data project owning that file so rpminspect knows to expect this change. You may also need to update the data package or local configuration file and change the forbidden_path_prefixes or forbidden_path_suffixes list.
es: Se encontraron archivos añadidos inesperadamente. Verifique que estos cambios sean correctos. Si no son, ajuste la compilación para evitar que se añadan archivos entre compilaciones. Si son correctos, actualice %s y envíe un parche al proyecto de datos de rpminspect propietario de ese archivo para que rpminspect sepa que debe esperar este cambio. También podría ser necesario actualizar el paquete de datos o el archivo de configuración local y cambiar las listas de “forbidden_path_prefixes” o “forbidden_path_suffixes”.
it: Sono state trovate aggiunte di file impreviste. Verificare che queste modifiche siano corrette. In caso contrario, modificare la build per impedire l'aggiunta di file tra le build. Se sono corretti, aggiorna %s e invia una patch al progetto dati RPMinspect che possiede quel file in modo che RPMinspect sappia aspettarsi questo cambiamento. Potrebbe anche essere necessario aggiornare il pacchetto dati o il file di configurazione locale e modificare l'elenco dei prefissi_percorso_proibiti o dei suffissi_percorso_proibiti.

source: Unexpected changed source archive content. The version of the package did not change between builds, but the source archive content did. This may be deliberate, but needs inspection. If this change is expected, update %s and send a patch to the project that owns that file.
es: Cambio inesperado en el contenido del archivo fuente. La versión del paquete no cambió entre compilaciones, pero sí el contenido del archivo fuente. Esto podría ser intencional, pero requiere revisión. Si se espera este cambio, actualice %s y envíe un parche al proyecto propietario de ese archivo.
it: Contenuto dell'archivio sorgente modificato inaspettatamente. La versione del pacchetto non è cambiata tra le build, ma il contenuto dell'archivio sorgente sì. Questo potrebbe essere intenzionale, ma richiede un controllo. Se questa modifica è prevista, aggiornare %s e inviare una patch al progetto proprietario di quel file.

source: Make sure the %%files section includes the %%defattr macro. If these permissions are expected, update %s and send a patch to the project that owns it.
es: Asegúrese que la sección %%files incluya la macro %%defattr. Si estos permisos son esperados, actualice %s y envíe un parche para el proyecto que lo pertenezca.
it: Assicurarsi che la sezione %%files includa la macro %%defattr. Se questi permessi sono previsti, aggiornare %s e inviare una patch al progetto che ne è proprietario.

source: Bin path files must be owned by the bin_owner set in the rpminspect configuration, which is usually root. If this ownership is expected, update %s and send a patch to the project that owns it.
es: Los archivos de ruta bin deben ser propietarios por el conjunto bin_owner dentro de la configuración rpminspect, la cual es usualmente root. Si esta posesión es esperada, actualice %s y envíe un parche para el proyecto que lo pertenezca.
it: I file nel percorso bin devono appartenere a bin_owner impostato nella configurazione di rpminspect, che di solito è root. Se questa proprietà è prevista, aggiornare %s e inviare una patch al progetto che ne è proprietario.

source: Bin path files must be owned by the bin_group set in the rpminspect configuration, which is usually root. If this ownership is expect, update %s and send a patch to the project that owns it.
es: Los archivos de ruta binaria debe ser propiedad por el conjunto bin_group dentro de la configuración rpminspect, la cual usualmente es root. Si esta propiedad es esperada, actualice %s y envíe un parche al proyecto que lo pertenezca.
it: I file nel percorso bin devono appartenere a bin_group impostato nella configurazione di rpminspect, che di solito è root. Se questa proprietà è prevista, aggiornare %s e inviare una patch al progetto che ne è proprietario.

source: Either chgrp the file to the bin_group set in the rpminspect configuration or remove the world execute bit on the file (chmod o-x). If this ownership is expected, update %s and send a patch to the project that owns it.
es: Puede ejecutar chgrp (cambia el grupo) del archivo al conjunto bin_group definido en la configuración de rpminspect o eliminar el bit de ejecución global del archivo (chmod o-x). Si se espera esta propiedad, actualice %s y envíe un parche al proyecto propietario.
it: O assegnare il file con chgrp al bin_group impostato nella configurazione di rpminspect oppure rimuovere il bit di esecuzione per gli altri dal file (chmod o-x). Se questa proprietà è prevista, aggiornare %s e inviare una patch al progetto che ne è proprietario.

source: Either chgrp the file to the bin_group set in the rpminspect configuration or remove the group write bit on the file (chmod g-w). If this ownership is expected, update %s and send a patch to the project that owns it.
es: Puede ejecutar chgrp al archivo para el conjunto bin_group definido en la configuración de rpminspect o eliminar el bit de escritura de grupo del archivo (chmod g-w). Si se espera esta propiedad, actualice %s y envíe un parche al proyecto propietario.
it: O assegnare il file con chgrp al bin_group impostato nella configurazione di rpminspect oppure rimuovere il bit di scrittura per il gruppo dal file (chmod g-w). Se questa proprietà è prevista, aggiornare %s e inviare una patch al progetto che ne è proprietario.

source: Verify the ownership changes are expected. If not, adjust the package build process to set correct owner and group information. If expected, update %s and send a patch to the project that owns it.
es: Verifique los cambios de propiedad especificados. Si no, ajunte el proceso de compilación del paquete para establecer propiedad correcta e información del grupo. Si se esperaban, actualice %s y envíe el parche al proyecto que lo pertenezca.
it: Verificare che le modifiche alla proprietà siano previste. In caso contrario, modificare il processo di compilazione del pacchetto per impostare le informazioni corrette su proprietario e gruppo. Se previste, aggiornare %s e inviare una patch al progetto che ne è proprietario.

source: rpminspect is expecting a fileinfo rule from the vendor data package for this file. Usually this means the file carries a non-standard set of permissions (e.g., setuid) which is a condition where rpminspect would check the fileinfo list to ensure the package conforms to the vendor rules. To remedy, add a fileinfo rule for this file to the vendor data package under the appropriate product release file.
es: rpminspect espera una regla de información de archivo “fileinfo” del paquete de datos del proveedor para este archivo. Esto suele significar que el archivo lleva un conjunto de permisos no estándar (p. ej., setuid), lo que implica que rpminspect revisaría la lista de información de archivo fileinfo para garantizar que el paquete cumpla con las reglas del proveedor. Para solucionarlo, agregue una regla de fileinfo para este archivo al paquete de datos del proveedor, dentro del archivo de versión del producto correspondiente.
it: rpminspect si aspetta una regola fileinfo dal pacchetto dati del fornitore per questo file. Solitamente ciò significa che il file ha un insieme di permessi non standard (ad es. setuid), condizione in cui rpminspect controllerebbe l'elenco fileinfo per assicurarsi che il pacchetto sia conforme alle regole del fornitore. Per rimediare, aggiungere una regola fileinfo per questo file al pacchetto dati del fornitore nel file di rilascio del prodotto appropriato.

source: Consult the shell documentation for proper syntax.
es: Consulte la documentación del shell para conocer la sintaxis adecuada.
it: Consultare la documentazione della shell per la sintassi corretta.

source: The file referenced was not a known shell script in the before build but is now a shell script in the after build.
es: El archivo al que se hace referencia no era un script de shell conocido en la compilación anterior, pero ahora es un script de shell en la compilación posterior.
it: Il file referenziato non era uno script shell noto nella build precedente, ma ora è uno script shell nella build successiva.

source: The referenced shell script is invalid. Consider debugging it with the '-n' option on the shell to find and fix the problem.
es: El script de shell al que se hace referencia no es válido. Considere depurarlo con la opción '-n' del shell para encontrar y solucionar el problema.
it: Lo script shell referenziato non è valido. Considerare di eseguirne il debug con l'opzione '-n' della shell per trovare e risolvere il problema.

source: See annocheck(1) for more information.
es: Consulte annocheck(1) para más información.
it: Vedere annocheck(1) per maggiori informazioni.

source: Ensure all object files are compiled with '-O2 -D_FORTIFY_SOURCE=2', and that all appropriate headers are included (no implicit function declarations). Symbols may also appear as unfortified if the compiler is unable to determine the size of a buffer, which is not necessarily an error.
es: Asegúrese de que todos los archivos de objeto se compilen con '-O2 -D_FORTIFY_SOURCE=2' y de que se incluyan todos los encabezados correspondientes (sin declaraciones de funciones implícitas). Los símbolos también pueden aparecer como no fortificados si el compilador no puede determinar el tamaño de un tampón, lo cual no es necesariamente un error.
it: Assicurarsi che tutti i file oggetto siano compilati con '-O2 -D_FORTIFY_SOURCE=2' e che tutte le intestazioni appropriate siano incluse (nessuna dichiarazione di funzione implicita). I simboli possono anche apparire come non fortificati se il compilatore non è in grado di determinare la dimensione di un buffer, il che non è necessariamente un errore.

source: DT_NEEDED symbols have been added or removed. This happens when the build environment has different versions of the required libraries. Sometimes this is deliberate but sometimes not. Verify these changes are expected. If they are not, modify the package spec file to ensure the build links with the correct shared libraries.
es: Se han añadido o eliminado símbolos DT_NEEDED. Esto ocurre cuando el entorno de compilación tiene diferentes versiones de las bibliotecas requeridas. A veces es intencional, pero a veces no. Verifique que estos cambios sean los esperados. De lo contrario, modifique el archivo de especificaciones del paquete para asegurar que la compilación se vincule con las bibliotecas compartidas correctas.
it: Simboli DT_NEEDED sono stati aggiunti o rimossi. Ciò accade quando l'ambiente di compilazione ha versioni diverse delle librerie richieste. A volte questo è intenzionale, ma a volte no. Verificare che queste modifiche siano previste. In caso contrario, modificare il file spec del pacchetto per garantire che la compilazione si colleghi alle librerie condivise corrette.

source: A file grew by a noticeable amount. Ensure this change is intended. If it is, you can adjust the filesize inspection settings in the rpminspect.yaml file.
es: Un archivo aumentó considerablemente. Asegúrese de que este cambio sea intencional. De ser así, puede ajustar la configuración de inspección del tamaño del archivo en el archivo rpminspect.yaml.
it: Un file è cresciuto notevolmente. Assicurarsi che questa modifica sia intenzionale. In tal caso, è possibile regolare le impostazioni di controllo della dimensione del file nel file rpminspect.yaml.

source: A file shrank by a noticeable amount. Ensure this change is intended. If it is, you can adjust the filesize inspection settings in the rpminspect.yaml file.
es: Un archivo se redujo considerablemente. Asegúrese que este cambio sea intencional. De ser así, puede ajustar la configuración de inspección del tamaño del archivo en el archivo rpminspect.yaml.
it: Un file si è ridotto notevolmente. Assicurarsi che questa modifica sia intenzionale. In tal caso, è possibile regolare le impostazioni di controllo della dimensione del file nel file rpminspect.yaml.

source: A previously empty file is no longer empty. Make sure this change is intended and fix the package spec file if necessary.
es: Un archivo anterior vacío no es más vacío. Asegúrese de que este cambio sea intencional y corrija el archivo de especificaciones del paquete si es necesario.
it: Un file precedentemente vuoto non è più vuoto. Assicurarsi che questa modifica sia intenzionale e correggere il file spec del pacchetto se necessario.

source: A previously non-empty file is now empty. Make sure this change is intended and fix the package space file if necessary.
es: Un archivo que antes no estaba vacío ahora está vacío. Asegúrese que este cambio sea intencional y corrija el archivo de espacio del paquete si es necesario.
it: Un file precedentemente non vuoto è ora vuoto. Assicurarsi che questa modifica sia intenzionale e correggere il file spec del pacchetto se necessario.

source: Unexpected capabilities were found on the indicated file. Consult capabilities(7) and either adjust the files in the package or modify the capabilities list in the rpminspect vendor data package. The security team may also be of help for this situation. If necessary, update %s with the changes found here and send a patch to the project that owns the data file.
es: Se encontraron capacidades inesperadas en el archivo indicado. Consulte la sección capabilities(7) y ajuste los archivos del paquete o modifique la lista de capacidades en el paquete de datos del proveedor de rpminspect. El equipo de seguridad también podría ser de ayuda en esta situación. Si es necesario, actualice %s con los cambios encontrados aquí y envíe un parche al proyecto propietario del archivo de datos.
it: Funzionalità (capabilities) inattese sono state trovate sul file indicato. Consultare capabilities(7) e regolare i file nel pacchetto o modificare l'elenco delle capabilities nel pacchetto dati del fornitore di rpminspect. Il team di sicurezza potrebbe essere d'aiuto in questa situazione. Se necessario, aggiornare %s con le modifiche trovate qui e inviare una patch al progetto proprietario del file di dati.

source: Kernel module parameters were removed between builds. This may present usability problems for users if module parameters were removed in a maintenance update.
es: Los parámetros del módulo del kernel se eliminaron entre compilaciones. Esto podría presentar problemas de usabilidad para los usuarios si se eliminaron los parámetros del módulo en una actualización de mantenimiento.
it: I parametri del modulo del kernel sono stati rimossi tra le build. Ciò può presentare problemi di usabilità per gli utenti se i parametri del modulo sono stati rimossi in un aggiornamento di manutenzione.

source: Kernel module dependencies changed between builds. This may present usability problems for users if module dependencies changed in a maintenance update.
es: Las dependencias del módulo del kernel cambiaron entre compilaciones. Esto puede presentar problemas de usabilidad para los usuarios si las dependencias del módulo cambian en una actualización de mantenimiento.
it: Le dipendenze del modulo del kernel sono cambiate tra le build. Ciò può presentare problemi di usabilità per gli utenti se le dipendenze del modulo sono cambiate in un aggiornamento di manutenzione.

source: Kernel module device aliases changed between builds. This may present usability problems for users if module device aliases changed in a maintenance update.
es: Los alias de dispositivo del módulo del kernel cambiaron entre compilaciones. Esto podría presentar problemas de usabilidad para los usuarios si los alias de dispositivo del módulo se modificaron en una actualización de mantenimiento.
it: Gli alias dei dispositivi del modulo del kernel sono cambiati tra le build. Ciò può presentare problemi di usabilità per gli utenti se gli alias dei dispositivi del modulo sono cambiati in un aggiornamento di manutenzione.

source: An architecture present in the before build is now missing in the after build. This may be deliberate, but check to make sure you do not have any unexpected ExclusiveArch lines in the spec file.
es: Una arquitectura presente en la compilación anterior ahora falta en la compilación posterior. Esto puede ser intencional, pero verifique que no haya líneas ExclusiveArch inesperadas en el archivo de especificaciones.
it: Un'architettura presente nella build precedente è ora mancante nella build successiva. Questo potrebbe essere intenzionale, ma controllare per assicurarsi di non avere righe ExclusiveArch inattese nel file spec.

source: A new architecture has appeared in the after build. This may indicate progress in the world of computing.
es: Ha aparecido una arquitectura nueva tras la compilación. Esto podría indicar un avance en el mundo de la informática.
it: Una nuova architettura è apparsa nella build successiva. Questo potrebbe indicare progressi nel mondo dell'informatica.

source: A subpackage present in the before build is now missing in the after build. This may be deliberate, but check to make sure you have correct syntax defining the subpackage in the spec file
es: Un subpaquete presente en la compilación anterior ahora falta en la compilación posterior. Esto puede ser intencional, pero verifique que la sintaxis que define el subpaquete en el archivo de especificaciones sea correcta
it: Un sotto-pacchetto presente nella build precedente è ora mancante nella build successiva. Questo potrebbe essere intenzionale, ma controllare per assicurarsi di avere la sintassi corretta che definisce il sotto-pacchetto nel file spec

source: A new subpackage has appeared in the after build. This may indicate progress in the world of computing.
es: Ha aparecido un nuevo subpaquete en la compilación posterior. Esto podría indicar un avance en el mundo de la informática.
it: Un nuovo sotto-pacchetto è apparso nella build successiva. Questo potrebbe indicare progressi nel mondo dell'informatica.

source: Make sure the spec file in the after build contains a valid %changelog section.
es: Asegúrese de que el archivo de especificaciones en la compilación posterior contenga una sección %changelog válida.
it: Assicurarsi che il file spec nella build successiva contenga una sezione %changelog valida.

source: Files should not be installed in old directory names. Modify the package to install the affected file to the preferred directory.
es: Los archivos no deben instalarse en directorios antiguos. Modifique el paquete para instalar el archivo afectado en el directorio preferido.
it: I file non dovrebbero essere installati in nomi di directory obsoleti. Modificare il pacchetto per installare il file interessato nella directory preferita.
