Repository: rpminspect/rpminspect-l10n
Catalog: *.po
Languages: es, it

source: -T LIST, --tests=LIST List of tests to run
es: -T LIST, --tests=LISTADO Listado de textos a ejecutar
it: -T LISTA, --tests=LISTA Lista di test da eseguire

source: (default: ALL)
es: (predet.: ALL)
it: (predefinito: ALL)

source: -E LIST, --exclude=LIST List of tests to exclude
es: -E LISTADO, --exclude=LISTADO Listado de pruebas para excluir
it: -E LISTA, --exclude=LISTA Lista di test da escludere

source: (default: none)
es: (predet.: none)
it: (predefinito: none)

source: -a LIST, --arches=LIST List of architectures to check
es: -a LIST, --arches=LIST Listado de arquitecturas para comprobar
it: -a LISTA, --arches=LISTA Lista di architetture da controllare

source: -r STR, --release=STR Product release string
es: -r CAD, --release=CAD Cadena del producto liberado
it: -r STR, --release=STR Stringa di rilascio del prodotto

source: -n, --no-rebase Disable build rebase detection
es: -n, --no-rebase Desactivar detección de rebase a compilar
it: -n, --no-rebase Disabilita il rilevamento del rebase della build

source: -b TYPE, --build-type=TYPE Set Koji build type to TYPE
es: -b TYPE, --build-type=TYPE Fija tipo de compilación Koji a TYPE
it: -b TIPO, --build-type=TIPO Imposta il tipo di build Koji a TIPO

source: -o FILE, --output=FILE Write results to FILE
es: -o ARCHIVO, --output=ARCHIVO Escribe resultados al ARCHIVO
it: -o FILE, --output=FILE Scrivi i risultati nel FILE

source: (default: stdout)
it: (predefinito: stdout)

source: -F TYPE, --format=TYPE Format output results as TYPE
es: -F TIPO, --format=TIPO Resultado del formato de salida como TIPO
it: -F TIPO, --format=TIPO Formatta i risultati di output come TIPO

source: (default: text)
es: (predet.: text)
it: (predefinito: text)

source: -t TAG, --threshold=TAG Result threshold triggering exit
es: -t TAG, --threshold=TAG Umbral de resultado disparando salida
it: -t TAG, --threshold=TAG Soglia di risultato che causa l'uscita

source: failure (default: VERIFY)
es: fallo (predet.: VERIFY)
it: con errore (predefinito: VERIFY)

source: -s TAG, --suppress=TAG Results suppression threshold
es: -s TAG, --suppress=TAG Supresión de resultado umbral
it: -s TAG, --suppress=TAG Soglia di soppressione dei risultati

source: (default: off, report everything)
es: (por defecto: off, informa todo)
it: (predefinito: off, riporta tutto)

source: -l, --list List available tests and formats
es: -l, --list Listado de test disponibles y formatos
it: -l, --list Elenca test e formati disponibili

source: -w PATH, --workdir=PATH Temporary directory to use
es: -w RUTA, --workdir=RUTA Directorio temporal para utilizar
it: -w PERCORSO, --workdir=PERCORSO Directory temporanea da usare

source: (default: %s)
es: (predet.: %s)
it: (predefinito: %s)

source: -f, --fetch-only Fetch builds only, do not perform inspections
es: -f, --fetch-only Captura compilados solo, no realizar inspecciones
it: -f, --fetch-only Scarica solo le build, non eseguire ispezioni

source: (implies -k)
es: (implica -k)
it: (implica -k)

source: -k, --keep Do not remove the comparison working files
es: -k, --keep No retira la comparación de archivos en fucionando
it: -k, --keep Non rimuovere i file di lavoro del confronto

source: -d, --debug Debugging mode output
it: -d, --debug Output in modalità di debug

source: -D, --dump-config Dump configuration settings (in YAML format)
it: -D, --dump-config Mostra le impostazioni di configurazione (in formato YAML)

source: -v, --verbose Verbose inspection output
it: -v, --verbose Output dettagliato dell'ispezione

source: when finished, display full path
it: alla fine, mostra il percorso completo

source: -?, --help Display usage information
it: -?, --help Mostra informazioni sull'utilizzo

source: -V, --version Display program version
it: -V, --version Mostra la versione del programma

source: See the rpminspect(1) man page for more information.
it: Consultare la pagina man rpminspect(1) per maggiori informazioni.

source: *** unable to compile product release regular expression: %s
it: *** impossibile compilare l'espressione regolare del rilascio del prodotto: %s

source: *** product release for after build (%s) is empty
it: *** il rilascio del prodotto per la build successiva (%s) è vuoto

source: *** product release for before build (%s) is empty
it: *** il rilascio del prodotto per la build precedente (%s) è vuoto

source: *** unable to determine product release for %s and %s
it: *** impossibile determinare il rilascio del prodotto per %s e %s

source: *** See the 'favor_release' setting in the rpminspect configuration file.
it: *** Vedi l'impostazione 'favor_release' nel file di configurazione di rpminspect.

source: *** the -T and -E options are mutually exclusive
it: *** le opzioni -T e -E si escludono a vicenda

source: *** See `%s --help` for more information.
it: *** Vedere `%s --help` per maggiori informazioni.

source: *** unknown inspection: `%s`
it: *** ispezione sconosciuta: `%s`

source: *** unsupported build type: `%s`.
it: *** tipo di build non supportato: `%s`.

source: *** invalid build type: `%s`.
it: *** tipo di build non valido: `%s`.

source: *** invalid output format: `%s`.
it: *** formato di output non valido: `%s`.

source: *** unable to expand working directory: `%s`
it: *** impossibile espandere la directory di lavoro: `%s`

source: *** unable to use `%s' as working directory
it: *** impossibile usare `%s' come directory di lavoro

source: %s version %s
it: %s versione %s

source: *** ?? getopt returned character code 0%o ??
it: *** ?? getopt ha restituito il codice carattere 0%o ??

source: Available build types:
it: Tipi di build disponibili:

source: Available output formats:
it: Formati di output disponibili:

source: Available inspections:
it: Ispezioni disponibili:

source: *** failed to read configuration file %s
it: *** Impossibile leggere il file di configurazione %s

source: *** Please specify a configuration file using '-c' or supply ./%s
it: *** Specificare un file di configurazione utilizzando '-c' o fornire ./%s

source: *** Invalid before and after build specification.
it: *** Specifiche non valide prima e dopo la compilazione.

source: *** unable to read RPM configuration
it: *** Impossibile leggere la configurazione RPM

source: *** unsupported architecture specified: `%s`
it: *** architettura non supportata specificata: `%s`

source: *** unable to create directory %s
it: *** Impossibile creare la directory %s

source: Version information for libraries and programs used by %s as well as storage requirements. This result is for informational and diagnostic purposes only.
it: Informazioni sulla versione delle librerie e dei programmi utilizzati da %s, nonché sui requisiti di archiviazione. Questo risultato è solo a scopo informativo e diagnostico.

source: Space required to download artifacts: %lu bytes (%s)
it: Spazio richiesto per scaricare gli artefatti: %lu byte (%s)

source: Space required to unpack artifacts: %lu bytes (%s)
it: Spazio richiesto per decomprimere gli artefatti: %lu byte (%s)

source: Command line arguments used to invoke %s.
it: Argomenti della riga di comando utilizzati per richiamare %s.

source: Local configuration file: %s
it: File di configurazione locale: %s

source: Before Build
it: Prima della Build

source: After Build
it: Dopo la Build

source: *** no peers, ensure packages exist for specified architecture(s)
it: *** nessun peer, assicurarsi che i pacchetti esistano per l'architettura specificata

source: *** unable to find a set of peer packages between the before and after builds
it: *** Impossibile trovare un set di pacchetti peer tra le build precedenti e successive

source: *** unable to determine product release or none specified (-r).
it: *** Impossibile determinare la versione del prodotto o nessuna specificata (-r).

source: Skipping %s inspection...
it: Ispezione %s saltata...

source: skip
it: salta

source: Running %s inspection...
it: Esecuzione dell'ispezione %s...

source: Keeping working directory: %s
es: Conservando directorio de trabajo: %s
it: Mantenimento della directory di lavoro: %s

source: build
es: compilar

source: task
es: tarea

source: ok
es: correcto

source: OK
es: ACEPTAR

source: directory
es: directorio
